[
    {
        "article_id": "a650fa2a53dcb69bf2dc7e8ac66bef59",
        "title": "What to know from NFL Week 16: Dolphins win thriller, Lions win NFC North, and more",
        "link": "https://www.espn.com/nfl/story/_/id/39156303/nfl-week-16-2023-questions-risers-fallers-takeaways-lessons-stats",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Answering lingering questions coming out of each game. Here's what we learned from Week 16.",
        "content": "of the NFL season started Thursday night with the strengthening their playoff hopes while putting a big dent in the playoff aspirations. To start off a two-game Saturday slate, the routed the , whose playoff hopes also took a big hit. Later, the took control of their playoff destiny with a narrow victory over the , who were playing their first game since firing coach Brandon Staley and general manager Tom Telesco last week. Games continued Sunday with a win over the Vikings that locked up the NFC North title, a big game by QB and WR and a go-ahead TD by the in the last minute to keep their playoff hopes alive. The beat the with a walkoff field goal, and the handed the their fourth straight loss. And the rode a 56-yard field goal as time expired to beat the in the night game. Our NFL Nation reporters reacted to all the action, answering lingering questions coming out of each game and picking out who -- or what -- is rising and falling for every team. Let's get to it. The Patriots, who entered the night in the No. 2 spot, now drop to No. 4. It's Chicago (from Carolina), Arizona, Washington in the top three spots, then New England and the Chargers. This was a night in which the Patriots finally found their offense -- 20 points in the third quarter were the most they've had in a quarter since Week 17 of the 2021 season, when they had 21 against the Jaguars. As part of that output, they scored touchdowns six seconds apart, which ties the shortest span between two TDs in Patriots history (2013 vs. Ravens, 2014 vs. Bengals), according to the Elias Sports Bureau. . The third-year defensive tackle had three sacks and seven tackles (two for a loss) as he continues to ascend in the best season of his career. Punt coverage. A 52-yard punt return and a late penalty were among the notable miscues. at Bills (Sunday, 1 p.m. ET) Almost certainly yes, given the Broncos' AFC record is now 4-6 and they are 7-8 overall. The Broncos had won five in a row to get into the postseason conversation, but they've lost three of their past four and now have a 2% chance to make it. The Broncos erased a 23-7 deficit in the fourth quarter as led two long scoring drives, and they made both 2-point conversions to tie it with 2:53 left. But the Patriots' kicked a 56-yard field goal for the winning score. TE . Krull, who has spent much of the season on the practice squad, had his first multicatch game and the first touchdown reception of his career. The Broncos entered the game with the second-fewest catches in the league among tight ends with 31. WR . On a night when the most consistent player on the offense -- -- was injured, Jeudy had an opportunity to fill the void, but he did not have a target or a catch until a 13-yard reception with 9:09 left in the game. vs. Chargers (Sunday, 4:25 p.m. ET) Miami had lost all three of its games against teams with winning records entering Week 16. The Dolphins helped their cause Sunday with a gritty win, holding off a late comeback by the visiting Cowboys. The victory secured a playoff berth for the second straight season and is likely to give this team confidence heading into a potential division-clinching game against the Ravens in Week 17. K . The Dolphins' longtime placekicker entered the game just 6-of-16 from 50 or more yards since 2021, but he nailed kicks of 57, 54 and 52 yards -- as well as a 29-yarder to win the game with time expiring. Receiver depth/health. Wideout had at least eight targets and four catches in each of his previous five games. But after he caught a 50-yard pass on the Dolphins' opening drive, eye and shin injuries forced him out of the game on two separate occasions. That was his lone reception on four targets. at Ravens (Sunday, 1 p.m. ET) Probably not. The loss all but guarantees the Cowboys will be the NFC's fifth seed, which means they will likely have to win three road games to get to the Super Bowl. History is not on their side. The Cowboys have never gone to a Super Bowl when they had a losing record on the road in the regular season. With this loss, the best they can do away from home this season is 4-5. DE . He did not record an official stat through three quarters but showed why stats don't determine a player's worth. Lawrence was the most impactful defender for the Cowboys, repeatedly slicing into the backfield to disrupt Miami's offense in both the run and pass games. Third-down offense. A week after going 5-of-13 on third downs versus the Bills, the Cowboys were just 3-of-11 against the Dolphins. This is the fifth time in eight road games the Cowboys have not converted more than 40% of their third downs. vs. Lions (Saturday, 8:15 p.m. ET) Jason Sanders connects on his fifth field goal of the game to give the Dolphins a dramatic 22-20 win over the Cowboys. One play after a 39-yard scramble by , the quarterback threw a baffling red zone interception that prevented the Bears (ahead 24-10) from icing the game with a three-score lead in the fourth quarter. The full Fields' experience -- coupled with a holding penalty on safety that negated a fourth-down stop -- allowed the Cardinals to score on the ensuing drive and cut the Bears' lead to eight. Chicago's sixth win doubles its total from a year ago, but these fourth-quarter issues have become way too predictable. The Bears displayed a balanced offensive attack and another solid defensive performance, but this team still needs to figure out how to finish off opponents. RB . The third-year back made the most of his first start in three weeks with inactive (personal). Herbert rushed for a season-high 112 yards and ran in his first touchdown of the season. Most importantly, the burst that Herbert had displayed prior to an ankle injury that landed him on injured reserve during Weeks 6-10 was back on display. End-of-half execution. The Bears would have gone into halftime with a three-score lead had it not been for Arizona RB running in a wide-open touchdown late in the second quarter. Chicago was penalized three times under the two-minute warning and went three-and-out on consecutive drives (six total passes, zero called runs after rushing for 117 yards in the first half). vs. Falcons (Sunday, 1 p.m. ET) It's a combination of things, but it comes down to this: QB played just his sixth game of the season Sunday, so he's still trying to figure out how to work with his receivers and in this offense, and Arizona lacks a big-bodied pass-catcher it can go to in clutch situations to make a play. K . The kicker took the NFL lead in 50-yard field goals this season with a 55-yarder in the third quarter, giving him nine (and only two misses). The passing game. Arizona accounted for just 208 passing yards against the Bears -- after tallying just 4 yards until about midway through the second quarter. Murray threw for 85 yards in the first half and 123 in the second half. at Eagles (Sunday, 1 p.m. ET) The Bucs put together arguably their most complete game of the year with a dominant performance on defense against the Jaguars, scoring two touchdowns off turnovers. Now the Bucs' path to a third consecutive division title has been laid out: beat the Saints next week or the Panthers in Week 18. Even with a loss in either game, the Bucs would win the tiebreaker over the Atlanta-New Orleans victor. The defense. Safety . recorded an interception, a sack and a fumble recovery that had been forced by cornerback . Inside linebacker had a first-quarter interception, outside linebacker had 1.5 sacks, two tackles for a loss, a forced fumble and a fumble recovery, and inside linebacker had a sack and a TFL. Any and all oddsmakers. The Bucs had only a 16% chance to make the playoffs in the preseason, per ESPN Analytics, and a 23% shot entering Week 13. vs. Saints (Sunday, 1 p.m. ET) The Jaguars have a 65% chance to win the AFC South, per ESPN Analytics, despite their four-game losing streak -- thanks to Houston and Indianapolis also losing Sunday. The Jaguars host 2-13 Carolina next Sunday, and then the Texans and Colts play each other in Week 18. But the Jaguars are playing their worst football of the season when it matters most, and nothing they did against Tampa Bay gives any indication that they're close to getting out of the funk. WR . (core muscle) is on IR and did not play because of a hamstring injury, so the Jaguars needed a receiver to step up. Cooks, an undrafted rookie, did for a bit in the first half, catching three passes for 38 yards -- including two that converted third downs. Cooks has appeared in seven games this season and those were the first catches of his career. K . He has missed five of his past six field goal attempts, including a 52-yarder against the Bucs that he pushed wide right. That was his third consecutive miss from 50-plus yards. His ability to make long field goals was one of the main reasons the Jaguars signed him in the spring and cut . vs. Panthers (Sunday, 1 p.m. ET) Jaguars QB Trevor Lawrence exits the game during the third quarter against Tampa Bay with an apparent shoulder injury. Johnson owes Zuerlein -- big time. The owner's pregame proclamation that he's planning to retain coach Robert Saleh and GM Joe Douglas in 2024 looked embarrassingly premature when the Jets fell behind by a point after blowing a 20-point lead. But Zuerlein, having a career year, saved everyone with a 54-yard field goal in the final seconds. Johnson wouldn't have reneged on his commitment as he believes in his leadership team despite a 6-9 record, but it would've been a poor optic. RB . Enjoying a late-season revival, Hall recorded the first multi-touchdown game of his career. He finished with 191 yards from scrimmage (95 rushing, 96 receiving), showing what the usually moribund offense can do when Hall is producing at an elite level. The defense. After a dominant first half, the defense collapsed by allowing 21 straight points to fall behind. This was nearly a classic letdown, fueled by costly penalties and poor situational awareness. The Jets had no answers for backup QB . at Browns (Thursday, 8:15 p.m. ET) Brissett played well in relief of for the second consecutive week, leading touchdown drives on five of the six drives he has played. The offense has stagnated under Howell. In the past two games, he has completed a combined 17 of 48 passes for 158 yards, one touchdown and three interceptions. It would help Howell to watch Brissett -- and it would help whomever the next coach is to determine whether the issues were on Howell or others. Simulate your own scenarios and check the latest playoff picture. • • | | RB . He ran hard, gaining 58 yards and scoring two touchdowns on 10 carries, and he showed that he could be a bigger part of Washington's future. Special teams. Washington had a punt blocked, lost a fumble at the end of a 24-yard run and committed a penalty on fourth-and-3, giving the Jets new life and leading to another touchdown. vs. 49ers (Sunday, 1 p.m. ET) Smith was a bit off in the first half, throwing for only 69 yards with some suspect accuracy. Then he shrugged off whatever rust he was dealing with from the two games he missed with a groin injury, catching fire in the second half. Smith (25-of-36, 227 yards) led two fourth-quarter touchdown drives, including the game winner with a minute left. He has had such an up-and-down season that his future in Seattle beyond 2023 is in question, but this was the type of strong performance that will put that conversation on hold. And it keeps the Seahawks' playoff hopes very much alive, with two winnable games remaining vs. Pittsburgh and at Arizona. WR . Metcalf's one-handed touchdown catch in the fourth quarter gives him six scores in the past six games and eight for the season. He finished with four catches for 56 yards and also drew a pass interference penalty to set up the game-winning touchdown. Seattle's discipline. The most penalized team in the NFL entering Sunday, the Seahawks were flagged six times for 47 yards against the Titans, including a pass interference ( ) and unnecessary roughness ( ) on Tennessee's go-ahead touchdown drive in the fourth quarter. vs. Steelers (Sunday, 4:05 p.m. ET) Plenty is on the line for the Titans, even though they are guaranteed a losing record. Approximately 20 potential free agents on the Titans want to show their value to the rest of the league, and other players like QB want to spin momentum into next season. Ending the year on a high note can change the tone of the offseason. It also wouldn't hurt for the Titans to get a chance to make it harder for their AFC South rivals to make the playoffs with games against the Texans on the road and at home against the Jaguars. RB . Henry had a much better day than last week, as he finished with 19 carries for 88 yards, along with his 89th career rushing touchdown. He also added his fifth career passing touchdown. QB . Making his first start since Week 6, Tannehill completed 18 of his 26 pass attempts for 152 yards on Sunday. But it was clear that he was rusty, as shown by how he frequently threw behind his receivers, forcing them to take big hits at times. at Texans (Sunday, 1 p.m. ET) Colby Parkinson wrestles his defender as he makes the touchdown catch from Geno Smith late in the fourth quarter. Sure, it was against the lowly Panthers, but Jones showed the dynamic that the Packers have missed since the opener. That was the last time an individual player had a 100-yard game from scrimmage, and it was Jones on that day, too. On Sunday, Jones (who has dealt with hamstring and knee injuries) went for 135 total yards (including 127 rushing for Green Bay's first 100-yard rushing game this season). The Packers were the only team entering Week 16 that did not have multiple 100-yard individual games this season. TE . Kraft hasn't let the injury to slow down the Packers' tight end production. Kraft caught four passes for 60 yards, including a 20-yarder that set up the game-winning score in the final minute. All aspects of the defense. A week after allowing the Bucs' to carve them up, the Packers let rookie throw for 311 yards, while the Panthers' offense totaled 393 yards and four touchdowns following a two-week stretch in which they hadn't scored a single offensive TD. at Vikings (Sunday, 8:20 p.m. ET) It's still baby steps, but yes. Young hadn't gotten a chance on a sneak before Sunday for fear his size (5-foot-10, 204 pounds) would be a hindrance. The Panthers had used (6-foot-5) instead. However, Young showed against the Packers he's fully capable, gaining 2 yards on fourth-and-1 to keep a drive alive. Carolina has used Young more under center of late, which opened up play-action passing that led to a career-high 311 yards Sunday. TE . The third-year tight end had four catches for a career-high 59 yards after having 16 catches for 118 yards over the first 14 games -- and no more than 35 yards receiving in a game his first three seasons. K . Carolina's kicker missed two extra points a week after kicking three field goals (including the game winner as time expired) to earn NFC Special Teams Player of the Week honors. at Jaguars (Sunday, 1 p.m. ET) Time expires on Bryce Young and the Panthers, who can't get a snap off in the final seconds. With 's big, accurate arm, absolutely. Flacco set the tone in Houston with a 53-yard completion to on the opening drive, the most air yards (45) on a Browns completion this season. Flacco came back in the second quarter with a 75-yard scoring strike to Cooper off play-action and a 21-yard touchdown dime to tight end through traffic. The Browns are suddenly a dynamic downfield passing team, with Cooper, Njoku and others making plays -- and Flacco, 38, zinging the ball around like it's 2012 all over again. WR . Cooper joined Terrell Owens as the only other NFL player with 200-yard receiving performances for three different franchises, while becoming the first Cleveland player to post back-to-back 1,000-yard receiving seasons. Special teams. The Browns gave up a 98-yard kickoff return touchdown to and lost reliable kicker to a hamstring injury on the same play. They went for two points following every touchdown after Hopkins departed. vs. Jets (Thursday, 8:15 p.m. ET) Yes. 's run has been shaky at best, as the offense in two games averaged 9.5 points, and three of those points came in their overtime win against the . Keenum went 11-of-17 for 62 yards with two interceptions before coach DeMeco Ryans put Mills in to finish the game with the score out of hand. The Texans (250 yards) were outgained by Browns receiver , who had 265 receiving yards. As long as Stroud is out, they have to at least try Mills. CB . Stingley had another interception, his fifth of the season. That's five in eight games. The pass defense. Browns quarterback passed for 368 yards and three touchdowns, and had two TDs. vs. Titans (Sunday, 1 p.m. ET) Joe Flacco throws a dot to Amari Cooper, who hauls it in for his second touchdown of the game. The offense looked strong behind a solid ground attack, and the Lions have won their first division crown since the 1993 season. With two games remaining before the postseason, Detroit has to tighten up on defense. is the fourth QB to start for the Vikings this season, and he was letting it fly against the secondary, which should cause concern for the Lions since they will face better competition in the playoffs. WR . The second-year receiver has continued to improve from week to week and posted his first career game with at least five receptions. He could be a key player down the stretch for the Lions. Special teams. Kicker 's extra point attempt was blocked in the third quarter. at Cowboys (Saturday, 8:15 p.m. ET) Almost certainly. According to ESPN's Football Power Index, Sunday's loss brought the Vikings' chances of making the playoffs down to 25%. They certainly have a built-in excuse, having lost their two most important players -- quarterback and receiver -- to injuries for large portions of the season. But they'll almost certainly rue the nature of some of their losses, almost all of which were by one score. Many of them were aided by turnovers; they entered the week ranked third in the NFL with 29. In the end, the Vikings will wind up about where everyone figured they would be -- out of the playoffs -- but they missed the opportunity for a special season. WR . When the Vikings targeted him, he was back to his old electric self, including a diving 29-yard touchdown reception in the second quarter that NFL Next Gen Stats recorded as the lowest-probability scoring reception (21%) of his career. RB . A week after thrilling Vikings fans with a 132-yard breakout game in Cincinnati, Chandler couldn't get going against a Lions defense that has been vulnerable against the run and finished with 17 yards on eight carries. vs. Packers (Sunday, 8:20 p.m. ET) If Atlanta plays like it did Sunday -- a balanced run/pass attack with 406 yards of offense and a defense that had six sacks and held the Colts to 262 yards -- it's possible. It is the best total game Atlanta has played this season, and while the Falcons will have to do it on the road, facing the under-.500 and is manageable. Playoffs or not, this would show legitimate progress, including Atlanta's first over-.500 record since 2017 and the first three-game winning streak in the same season in Arthur Smith's three years as coach. QB . In the first start of Heinicke's second stint as the Falcons' starter, he was efficient, completing 23 of 33 passes for 229 yards, one touchdown, no interceptions and a passer rating of 99.2. CB . The fourth-year pro appears to have been displaced by rookie cornerback in the starting lineup after Okudah barely played defensively and Phillips recorded three tackles with a pass defended. at Bears (Sunday, 1 p.m. ET) The Colts showed up flat one week after easily disposing of the Steelers in a critical win. This came after a blowout loss the previous week in Cincinnati. The Colts have been overachieving, and their disparate results might be an indication of who they really are. One example of how they've gotten the most out of their season: The Colts entered with a takeaway in 19 straight games, but they saw that streak snapped Sunday. They'd also won five of six prior to Sunday -- the best record in the NFL during that span. Now, Indianapolis has lost two of three at the wrong time and its playoff chances dropped to 42%. LB. . Although the defense was disappointing, Speed was all over the field Sunday, recording a career high in tackles for the second straight week. He recorded 13 total stops after netting 10 against Pittsburgh last week. Pass rush. The unit entered the game on fire, netting 25 sacks in the past six games. But was stymied Sunday, recording just a lone sack and creating little pressure on Heinicke. vs. Raiders (Sunday, 1 p.m. ET) Jessie Bates III grabs the interception and the Falcons' defense breaks out a dance routine afterward. It's a reminder of what this season has been. Of the Bills' 14 games, 10 have been one-score affairs. Adequately closing out opponents has been an issue all season. 's ball security is an issue, and the defense is allowing too many drives. Winning is ultimately what matters at this point in the season, but Saturday showed this team still has things to work on despite now controlling its playoff destiny. . The Bills punter has had some up-and-down games lately, but he was key to giving the Chargers a long field. Three of his four punts went inside the 20-yard line, and he averaged 52.3 yards per punt. That's a good sign for this special teams unit moving forward. Passing game. & Co. got things going when they needed to, but the Chargers came into this game with one of the worst pass defenses in the league. Allen completed just 15 of 21 passes for 237 yards, a touchdown and a pick with miscues throughout the game in connecting with receivers. It remains inconsistent. vs. Patriots (Sunday, 1 p.m. ET) James has been one of the Chargers' best players since he was drafted in 2018, establishing himself as one of the league's best safeties. But in James' first game since the Chargers fired coach Brandon Staley, James played two snaps at safety and 40 for the game, both season lows. He played most of the game as a nickel cornerback. Under Staley, James played the nickel role in spots, but his main home was at safety, making Saturday's game particularly surprising. Kicker . Staley earned the nickname \"fourth-and-Staley\" for his willingness to go for fourth-down conversions, often leaving Dicker on the sideline. In the first game since Staley's firing, Dicker made a career-high five field goals, almost winning the game for the Chargers himself. It was the first time the Chargers made five field goals since 2012. Running back . Kelley played a season-low 12 total snaps, including seven on offense. Kelley was the Chargers' backup running back coming into this season and started two games while was out with an injury, but he appears to have fallen out of favor in the Chargers' backfield. at Broncos (Sunday, 4:25 p.m. ET) Josh Allen lobs the ball to Gabe Davis, who makes the catch and drags a defender into the end zone for a Bills touchdown. After the game, Mike Tomlin told reporters it was too early to ask. Maybe so, but it's certainly not too early to consider the possibility that has earned the opportunity to start again after throwing for 279 yards and two touchdowns. QB was a limited participant in practice this week after having TightRope surgery on his right ankle on Dec. 4. He was inactive against the Bengals but could be ready to play the Seahawks. Still, Rudolph played a smart game and earned his first game ball for the performance -- and maybe another start. Wide receiver . Pickens had a career performance with 195 receiving yards and two touchdowns on the heels of a week in which he was heavily showing that he has an impossibly high ceiling when he's at his best. Fire Mike Tomlin chants. Hard to find much that went wrong in a resounding win. But it was a tough game for any disgruntled fans who came into Acrisure Stadium ready to unleash Fire Tomlin chants. Instead, the fourth quarter had four Mason Rudolph chants and one for Rudolph the Red-Nosed Reindeer, something Steelers players agreed was a welcome change. at Seahawks (Sunday, 4:05 p.m. ET) Well, it certainly puts a massive dent in them. The Bengals' playoff chances are down to 14% after the loss, per ESPN Analytics. But if the Bengals miss the postseason, they can squarely point at their AFC North record. After Saturday, the Bengals are 0-5 in divisional play. Cincinnati was swept by Baltimore and Pittsburgh. Depending on what happens over the next two weeks, even a win against the Browns on Week 18 might mean nothing for the Bengals. WR . With out, he racked up five catches for 140 yards and a touchdown, including an 80-yard touchdown in the third quarter. QB . Browning forced the issue too often and threw three interceptions in his worst performance as a starter in place of the injured Joe Burrow. at Chiefs (Sunday, 4:25 p.m. ET) Mason Rudolph throws a pass to George Pickens, who takes it 86 yards to the end zone and gives the Steelers a 7-0 lead against the Bengals. The Rams aren't in the playoffs yet -- they've got a 78% chance, per ESPN Analytics -- but they are playing like a team that could make a run. Since RB returned in Week 12, this Rams team has looked like a different group than the one that sat at 3-6 during its Week 10 bye. There's \"no doubt,\" coach Sean McVay said, \"we're different when he plays.\" Los Angeles has scored at least 28 points in the five games since Williams returned and has won six out of its past seven games, the lone loss coming against the AFC-leading . QB . The Rams quarterback has thrown multiple passing touchdowns in five straight games, his longest streak since joining the Rams, according to ESPN Stats & Information. He's also gone four straight games without an interception, which is tied for his longest streak with Los Angeles. Kicker missed a 47-yard field goal attempt in the second quarter. Los Angeles has missed a league-high 11 field goals this season. It's the most by any team since the 2015 Buccaneers (11), according to ESPN Stats & Information. at Giants (Sunday, 1 p.m. ET) The Saints now have to win out and get some help to make the playoffs. Their loss exposed issues all around both defensively (tackling) and offensively (they struggled to convert on third and fourth down). The Saints now have to travel to Tampa Bay for a divisional game after the disappointment of such a pivotal loss. How they respond will likely dictate any decisions made about the coaching staff or personnel once the season ends. WR . Olave battled through an ankle injury that caused him to miss Sunday's game and responded with a season-best nine catches for 129 yards to get him over 1,000 receiving yards for the season. CB . Taylor was benched for late in the game, and Saints coach Dennis Allen said the Rams got Taylor \"a couple of times with his eyes.\" at Buccaneers (Sunday, 1 p.m. ET)",
        "pubDate": "2023-12-25 06:03:01",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "canada",
            "united states of america",
            "india",
            "australia",
            "singapore"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "40b8a0561e82dd740e542ebb21549b78",
        "title": "Follow live: Broncos look to pull off fourth-quarter comeback, avoid upset",
        "link": "https://www.espn.com/nfl/game?gameId=401547621",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Follow live: Broncos look to pull off fourth-quarter comeback, avoid upset",
        "content": null,
        "pubDate": "2023-12-25 04:07:12",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "united states of america",
            "canada",
            "united kingdom",
            "australia",
            "india"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "3b5a2e104a029a57f439c4d4b6dda136",
        "title": "Patriots' Ezekiel Elliott hurdles en route to TD, lead over Broncos",
        "link": "https://www.espn.com/nfl/story/_/id/39180775/patriots-ezekiel-elliott-hurdles-td-broncos",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Elliott caught a short pass and found the end zone for his fourth TD this season.",
        "content": "DENVER -- After a lackluster first half void of offensive fireworks, running back provided sparks early in the third quarter against the on Sunday night. Elliott's athletic hurdle, and then dash to the end zone for a diving touchdown, is likely to be showing up on SportsCenter's Top 10 plays segment. The Patriots were trailing 7-3, and facing second-and-10 from the Denver's 15-yard line. Elliott caught a short pass from quarterback -- who was in the shotgun and had dropped back to the 23 -- at the 16-yard line on the right side of the field. Broncos cornerback went for a low tackle at the 12, and Elliott used his left hand as leverage to hurdle over him. Zappe ➡️ Zeke! TD 📺: on 📱: Stream on Elliott landed at around the 9-yard line and then raced to the right pylon, diving across the goal-line as linebacker was in pursuit. Elliott then pointed to an imaginary watch on his left hand and gave his trademark \"feed me\" celebration. However, rookie kicker missed the extra point, as the Patriots led 9-7 after the sequence with 9:48 remaining in the third quarter.",
        "pubDate": "2023-12-25 03:17:22",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "canada",
            "singapore",
            "united states of america",
            "india",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "005a75ae956ccf935ae84def83b97799",
        "title": "Dolphins secure playoff berth on last-second kick",
        "link": "https://www.espn.com/nfl/story/_/id/39180240/dolphins-top-cowboys-secure-playoff-spot-last-second-field",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Jason Sanders kicked his fifth field goal of the game, a 29-yarder as time expired, in Miami's win over Dallas.",
        "content": "MIAMI GARDENS, Fla. -- kicked his fifth field goal of the game, a 29-yarder as time expired, and the secured a playoff berth with a 22-20 victory over the on Sunday. threw for 293 yards and a touchdown for the AFC East-leading Dolphins (11-4), who beat a team with a winning record for the first time this season. He connected with twice on the decisive drive, which covered 64 yards and took the final 3:27 off the clock. Hill, who leads the NFL in receiving yards, had nine catches for 99 yards after missing last week's victory over the with an ankle injury. went 20 of 32 for 253 yards and two touchdowns for the Cowboys (10-5), who have already clinched a playoff spot but fell a half-game behind in the NFC East. Prescott put the Dallas in front 20-19 with an 8-yard touchdown pass to a leaping Brandin Cooks in the corner of the end zone. But the Cowboys were haunted by their red-zone struggles earlier in the game, including a fumble by Prescott on first-and-goal from inside the 1 on Dallas' first possession. Sanders' first field goal was a career-long 57-yarder in the first quarter. He added kicks of 52, 54 and 35 yards to help the Dolphins take a 19-10 lead late in the third. Prescott rallied the Cowboys with some dynamic playmaking. On the go-ahead drive, he completed a pass to as Miami linebacker was pulling him to the ground at the 21. After Miami safety was flagged for defensive holding in the end zone on fourth-and-goal, Prescott got the ball to Cooks, who hauled in the ball over over All-Pro cornerback . caught six passes for 118 yards for the Cowboys, including a 49-yard score in the first quarter. scored his NFL-leading 21st touchdown of the season on a grab from Tagovailoa just before halftime. The 31-year-old, who was undrafted out of Purdue in 2015 and bounced around the league earlier in his career, had 46 yards rushing Sunday to put him over 1,000 yards for the first time in his career. He's the Dolphins' first 1,000-yard rusher since in 2016. The Cowboys drove 78 yards in 15 plays on their first possession, but a bad exchange between Prescott and running back resulted in a fumble that the Dolphins recovered at their 1. Miami defensive coordinator Vic Fangio opted to not have Ramsey shadow Lamb, and it initially looked like the dynamic fourth-year receiver would make him pay for it. Lamb torched the rest of Miami's secondary early for 93 yards on four catches in the first quarter. Prescott hit Lamb on a crossing route that went 22 yards on the Cowboys' second possession. A few plays later, Lamb beat second-year cornerback in the slot for a catch-and-run touchdown that put Dallas ahead 7-3. After giving up more than 150 yards on Dallas' first two drives, Miami's defense settled in. Fangio dialed up more pressures, and it worked. The Dolphins sacked Prescott four times, which gave them a franchise-best 50 on the season and forced four straight Cowboys punts. Dallas got back into the red zone early in the fourth quarter, but Miami's defense held and the Cowboys settled for a field goal to get within 19-13.",
        "pubDate": "2023-12-25 01:14:54",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "india",
            "canada",
            "australia",
            "united kingdom",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "6e32d66b8bf871c923cc456c7f256d7b",
        "title": "Dak Prescott connects with CeeDee Lamb for 49-yard Cowboys TD",
        "link": "https://www.espn.com/nfl/story/_/id/39179378/dak-prescott-connects-ceedee-lamb-49-yard-cowboys-td-miami-dolphins",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Cowboys strike first on a thrilling catch-and-run by Lamb.",
        "content": "MIAMI GARDENS, Fla. -- entered Sunday's game against the needing nine catches to set the ' single-season record, set by (111) in 1995. Lamb had four catches for 93 yards on two drives in the first quarter, including a 49-yard touchdown. His score was a thing of beauty: a 49-yard catch-and-run from with Lamb running away from after the catch and then slipping inside to get to the end zone to tie the score at 7-7 with 1:30 left in the quarter. Lamb reached 19.9 mph on the play, according to NFL Next Gen Stats. Get 💿 the ball and see what happens 🤧 + It marked the seventh straight game Lamb has scored a touchdown, becoming just the third Cowboy to achieve that feat and the first since receiver in 2012. had seven straight games with a TD in 2007. It is also tied for the second-longest touchdown grab of Lamb's career. He had a 52-yarder as a rookie. No NFL wide receiver had scored a touchdown in seven straight games since in 2020, when he had eight in a row for the . The Cowboys have lined up Lamb in the backfield (8-yard run), outside and in the slot, which might make it even more difficult for the Dolphins if they want to call on cornerback to shadow Dallas' top receiver.",
        "pubDate": "2023-12-24 23:04:01",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "india",
            "united kingdom",
            "united states of america",
            "australia",
            "canada",
            "singapore"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "2cb375a472b9675f667c7903a36d4f86",
        "title": "Lions hold off Vikings, win 1st division title since 1993",
        "link": "https://www.espn.com/nfl/story/_/id/39179137/lions-end-long-drought-win-1st-division-title-93",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Lions clinched the NFC North title on Sunday, the franchise's first division title since 1993.",
        "content": "MINNEAPOLIS -- wasn't even born the last time the clinched a division title. However, on Sunday, the veteran quarterback -- born in 1994 -- was at the forefront of the Lions celebrating their first division championship since 1993. With the 30-24 win over the , Detroit clinched its first division title in three decades, ending the NFL's second longest active drought without a division title next to the (1989). Goff passed for 257 yards and a touchdown and rookie rushed for 80 yards and two touchdowns, but it was 's game-sealing interception of a pass at the Lions' 5-yard line with 58 seconds remaining with the Vikings driving for the potential go-ahead score that sealed the victory. The interception was Mullens' fourth of the game. Entering the game, Goff said the current Lions team didn't \"carry the weight of the last 30 years here\" with the division-winning drought. However, their head coach Dan Campbell, also a former Lions player, made it a priority for guys to understand the special opportunity they had in front of them to accomplish this season-long goal. \"I definitely do, and I think that's what a lot of this is about, but we are a young team and most of these guys weren't even born, the last time that they won a division,\" Campbell said during Friday's practice. \"So, it's not but I think they also understand how special it will be. You're telling me that we can be a division winner for the first time in 30 years for an organization, that's special. I don't care how you cut it. So, whatever perspective you take, it's still special. So, I think that's the message and they understand that. Look, we want this.\" Wayne Fontes was head coach of the Lions in 1993 when they finished 10-6 and clinched the NFC Central division in the last week of the regular season with a win over the . He can barely recall his feelings during that moment, as so much time has passed, but the 83-year-old is a big fan of Campbell. \"Congratulations. Dan Campbell has done a great job. He's an outstanding coach,\" Fontes told ESPN. \"The football team is well-coached. Their assistant coaches do a great job and Dan Campbell is probably one of the best coaches to come around in a long, long time in Detroit. I keep rooting for them and I think they're gonna continue to win because again, they have a good coach, coaching staff and good players.\" \"Thirty years is a long time ago,\" Fontes added, laughing. \"Dan Campbell deserves a good atta boy or way to go or whatever because he's done a great job. I really believe that.\"",
        "pubDate": "2023-12-24 21:48:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "india",
            "united states of america",
            "australia",
            "canada",
            "united kingdom"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "86309141bb13cc1e13756fff30b93f16",
        "title": "WR Cooper bags Browns mark with 265 yards",
        "link": "https://www.espn.com/nfl/story/_/id/39179285/amari-cooper-sets-browns-receiving-record-265-yards",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Amari Cooper set a Browns single-game record with 265 receiving yards. It was the fourth time he's reached the 200-yard milestone, one off the NFL mark.",
        "content": "HOUSTON -- Wide receiver made history Sunday. And behind his monster performance in a over the , the are on the precipice of their first playoff appearance since 2020. Cooper caught 11 passes for a Browns-record 265 yards, surpassing the mark previously held by (261 in 2013). He came back into the game in the fourth quarter following a late Texans rally, catching a 13-yard pass on fourth-and-7 to break the mark. Cooper now has four 200-yard receiving games in his career -- one off the NFL record shared by Calvin Johnson and Lance Alworth -- and he became just the second NFL player to reach the milestone with three different franchises. Cooper also achieved the feat for the and , joining Terrell Owens ( , Cowboys and ) as the only other player to do it. Amari Cooper is the sixth player in NFL history with four career 200-yard receiving games. Cooper also passed 1,000 yards on the season, to become the first Cleveland player ever to put up back-to-back 1,000-yard receiving seasons. Cooper finished with 1,160 receiving yards last season in his first with the Browns and has 1,250 this year with two regular-season games left to play. The Browns (10-6) figure to be playing for playoff seeding in their final two games. According to ESPN Stats & Information, Cleveland now has a better than 99% chance to make the postseason, though the Browns can't clinch a playoff spot until next week with the and both winning Saturday. Cleveland was alone in the 5 seed in the AFC playoff picture coming into the weekend. The Browns are still alive for the AFC North title, as well, trailing the (11-3) by only a game-and-a-half. The Ravens face the on Monday night. Amari Cooper set a Browns single-game franchise record with 265 receiving yards against the Texans on Sunday. Cooper set the tone early Sunday with a 53-yard reception from quarterback on the opening drive to set up Cleveland's first score. In the second quarter, he hauled in a 75-yard touchdown pass down the sidelines despite a defensive pass interference call for the longest Browns scoring grab since 2020. Cooper later caught a 7-yard touchdown in the third quarter and added a two-point reception early in the fourth quarter for a 36-7 lead. He sat out for most of the fourth quarter, but returned after the Texans scored back-to-back touchdowns, including one after an onside kick, to trim Cleveland's lead to 14 points.",
        "pubDate": "2023-12-24 21:46:46",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "india",
            "united states of america",
            "australia",
            "canada",
            "united kingdom"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "ca4020b5efa80ef84143fbedb3bb16bc",
        "title": "Lions hold off Vikings, win 1st division title since 1993",
        "link": "https://www.espn.com/nfl/story/_/id/39179137/lions-end-nfl-longest-drought-win-1st-division-title-93",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Lions clinched the NFC North title on Sunday, the franchise's first division title for the franchise since 1993.",
        "content": "MINNEAPOLIS -- wasn't even born the last time the clinched a division title. However, on Sunday, the veteran quarterback -- born in 1994 -- was at the forefront of the Lions celebrating their first division championship since 1993. With the 30-24 win over the , Detroit clinched its first division title in three decades, ending the NFL's second-longest active drought without a division title next to the (1989). Goff passed for 257 yards and a touchdown and rookie rushed for 80 yards and two touchdowns, but it was 's game-sealing interception of a pass at the Lions' 5-yard line with 58 seconds remaining with the Vikings driving for the potential go-ahead score that sealed the victory. The interception Mullens' fourth of the game. Entering the game, Goff said the current Lions team didn't \"carry the weight of the last 30 years here\" with the division-winning drought. However, their head coach Dan Campbell, also a former Lions player, made it a priority for guys to understand the special opportunity they had in front of them to accomplish this season-long goal. \"I definitely do, and I think that's what a lot of this is about, but we are a young team and most of these guys weren't even born, the last time that they won a division,\" Campbell said during Friday's practice. \"So, it's not but I think they also understand how special it will be. You're telling me that we can be a division winner for the first time in 30 years for an organization, that's special. I don't care how you cut it. So, whatever perspective you take, it's still special. So, I think that's the message and they understand that. Look, we want this.\" Wayne Fontes was head coach of the Lions in 1993 when they finished 10-6 and clinched the NFC Central division in the last week of the regular season with a win over the . He can barely recall his feelings during that moment, as so much time has passed, but the 83-year-old is a big fan of Campbell, Detroit's new beloved coach. \"Congratulations. Dan Campbell has done a great job. He's an outstanding coach,\" Fontes told ESPN. \"The football team is well-coached. Their assistant coaches do a great job and Dan Campbell is probably one of the best coaches to come around in a long, long time in Detroit. I keep rooting for them and I think they're gonna continue to win because again, they have a good coach, coaching staff and good players.\" \"Thirty years is a long time ago,\" Fontes said, laughing. \"Dan Campbell deserves a good atta boy or way to go or whatever because he's done a great job. I really believe that.\"",
        "pubDate": "2023-12-24 21:28:28",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "india",
            "singapore",
            "united kingdom",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "5c25cb43d742d2d09ecb0b9c60498c59",
        "title": "Etienne leaves Gators for rival Georgia via portal",
        "link": "https://www.espn.com/college-football/story/_/id/39178104/source-trevor-etienne-transferring-florida-georgia",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Trevor Etienne, who rushed for 1,472 yards and 14 touchdowns over the past two seasons for Florida, is transferring to rival Georgia via the portal.",
        "content": "added an SEC running back to its roster with announcing Sunday that he is transferring from to play for the Bulldogs. Etienne, who made the announcement on X (formerly Twitter), has spent the past two seasons playing for the Gators after signing as an ESPN 300 prospect out of high school. He split carries with this season and rushed for 753 yards and a team-leading eight rushing touchdowns. He played all 13 games during his true freshman season in 2022, rushing for 719 yards and six touchdowns on 118 carries while also helping in the return game. Georgia will lose its top two rushers with seniors and both moving on. The two combined for 1,505 yards and 23 touchdowns this season and leave a gaping hole at the position. Etienne will be an immediate help and will join , and in the backfield in 2024. The Bulldogs are also bringing in ESPN 300 running backs and , who are both ranked in the top 10 at the position. Star tight end also is moving on, and the Bulldogs could lose wide receivers and if they decide to leave. Coach Kirby Smart and his staff have been active in the transfer portal to help replace those spots, with receiver , receiver and now Etienne, who will all contribute right away.",
        "pubDate": "2023-12-24 20:54:04",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "india",
            "singapore",
            "united kingdom",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "569b925fa63cc3d133c65fafa52caa59",
        "title": "Ohtani gifts new Porsche to Kelly's wife for No. 17",
        "link": "https://www.espn.com/mlb/story/_/id/39178278/shohei-ohtani-gives-porsche-joe-kelly-wife-no-17-dodgers",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "New Dodgers acquisition Shohei Ohtani gifted a new Porsche to Joe Kelly's wife in return for her campaign to give her husband's No. 17 to the two-way star.",
        "content": "Ashley Kelly, the wife of relief pitcher , has a good reason to be in the holiday spirit after offering up her husband's No. 17 to new acquisition via a social media campaign. Her gift to Ohtani was reciprocated Saturday, with Ohtani delivering a new silver Porsche to a stunned Ashley Kelly in return. A video that the Saturday night showed Ashley opening the front door to see the new car parked at the curb. \"It's yours. From Shohei,\" the delivery driver told her. \"He wanted to gift you a Porsche.\" Ashley Kelly publicly lobbied for Ohtani to sign with the Dodgers with her #Ohtake17 social media campaign. She comically reached out to Ohtani, showing him all the No. 17 garb in the family's closets that could be converted for use by him and his family. She even offered to rename the couple's baby, Kai, to ShoKai. After Ohtani signed a record with the Dodgers earlier this month, Kelly on Instagram of her throwing all her No. 17 Kelly garb on her front lawn and then drawing a \"Kelly 99\" on the back of her husband's shirt with a Sharpie. Joe Kelly, who had worn No. 17 since 2019, has officially given up the number to Ohtani, who wore that number during his six seasons with the . The veteran reliever now will don No. 99 for the Dodgers. \"I wasn't going to give it up to just anybody,\" Kelly said after Ohtani was announced as his new teammate. \"If Shohei keeps performing, he'll be a future Hall of Famer and I'll be able to have my number retired. That's the closest I'll get to the Hall of Fame.\"",
        "pubDate": "2023-12-24 20:54:03",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "india",
            "singapore",
            "united kingdom",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "d78ad04a105ccf38c7f7ec45c3ca5ca3",
        "title": "Source: Former 5-star DT Nolen joining Ole Miss",
        "link": "https://www.espn.com/college-football/story/_/id/39178578/five-star-dt-walter-nolen-transferring-ole-miss",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Defensive tackle Walter Nolen, the No. 1 overall prospect in the 2022 recruiting class, is transferring from Texas A&M to Ole Miss, a source confirmed to ESPN.",
        "content": "Former five-star defensive tackle is transferring to , a source confirmed to ESPN on Sunday. The 6-foot-4, 290-pound sophomore entered the transfer portal this offseason and is leaving after two seasons with the program. Nolen was the No. 1 overall prospect in the 2022 class out of Powell, Tennessee, and he committed to the Aggies over nearly every other major program that was after him. He played in 10 games as a true freshman in 2022 and had 29 total tackles, 2.5 tackles for loss and a sack. He improved on those numbers this season, playing in 12 games and posting 37 total tackles, 8.5 tackles for loss and four sacks. Nolen will have two years of eligibility remaining and is part of an incredible haul this offseason for defensive coordinator Pete Golding and Ole Miss. In addition to Nolen, the Rebels are getting transfers from edge , edge rusher , cornerback , Tennessee safety , safety , linebacker cornerback and safety . The addition of Nolen gives Ole Miss a big, versatile lineman in the middle who will help in multiple ways in the 2024 season. On3 first reported that Nolan would enroll with the Rebels.",
        "pubDate": "2023-12-24 20:54:03",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "india",
            "singapore",
            "united kingdom",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "c2e5719360c5b8114c69c5ea65bbf5b8",
        "title": "EMU apologizes for postgame bowl sucker punch",
        "link": "https://www.espn.com/college-football/story/_/id/39178652/eastern-michigan-apologizes-player-punch-vs-south-alabama",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Eastern Michigan has apologized and has promised a full investigation with the MAC after one of its players punched a South Alabama player following the 68 Ventures Bowl.",
        "content": "has \"strongly\" condemned the \"completely unacceptable\" actions of a player who sucker punched a player in the back of the helmet, leading to a postgame brawl following the 68 Ventures Bowl on Saturday night. on social media shows Eastern Michigan defensive back running across the field and punching South Alabama cornerback in the back of the helmet while Burt was facing the stands for the school's alma mater following the Jaguars' in Mobile, Alabama. A skirmish broke out, players from both squads had to be separated, and the teams were sent to their locker rooms. \"We strongly condemn the actions of some of the student-athletes on the EMU football team in the ugly incident that took place following last night's 68 Ventures Bowl. We are deeply upset and embarrassed by what happened,\" Eastern Michigan athletic director Scott Wetherbee said in a statement Sunday. \"Their conduct does not reflect the great pride and high standards we place on the game and our program, and the expectations for good sportsmanship and exemplary conduct of student-athletes on and off the field. What happened was completely unacceptable. We apologize to the Eastern Michigan University community and to the South Alabama team and their fans.\" Wetherbee said he and Eagles coach Chris Creighton have both apologized to South Alabama athletic director Joel Erdmann and coach Kane Wommack. Wetherbee said he and Eastern Michigan president James Smith have been in contact with MAC commissioner Jon Steinbrecher and are \"committed to working jointly to investigate the incident.\" Erdmann said in a statement that South Alabama was \"grateful\" to Eastern Michigan \"for taking ownership of the incident\" and reaching out to \"apologize and ensure us they will fully investigate the matter.\"",
        "pubDate": "2023-12-24 20:54:03",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "india",
            "singapore",
            "united kingdom",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "a80a31568cb6e17b52118654634c2c56",
        "title": "Justin Jefferson dives for first touchdown catch since Week 4",
        "link": "https://www.espn.com/nfl/story/_/id/39178612/justin-jefferson-catches-diving-td-minnesota-vikings",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "According to NFL Nex Gen Stats, the touchdown had a 21% completion probability, the lowest of any of the 29 receiving touchdowns in his career.",
        "content": "MINNEAPOLIS -- Now is really back. The All-Pro receiver caught his first touchdown Sunday since Week 4, a diving 29-yard snag in the corner of the end zone to pull the Vikings within 17-14 against the Detroit Lions just before halftime at U.S. Bank Stadium. . improvising. 📺: on FOX 📱: Stream on Jefferson missed seven games after injuring his right hamstring in Week 5, and his return in Week 14 against the was cut short by a chest bruise. He played a full game in Week 15 at the but did not score. But quarterback focused on him during a two-minute drill after fellow receiver had departed with an ankle injury. Jefferson caught passes of 22 and 29 yards on the drive before the scoring reception. According to NFL Next Gen Stats, the touchdown had a 21% completion probability, the lowest of any of the 29 receiving touchdowns in his career.",
        "pubDate": "2023-12-24 19:47:08",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "australia",
            "singapore",
            "canada",
            "united kingdom",
            "india",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "544af1bffbe4fb5179b449987cb306f9",
        "title": "Follow live: Lions can clinch division title and a playoff spot with a win",
        "link": "https://www.espn.com/nfl/game/_/gameId/401547618",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "With a win, the Lions can clinch the division for the first time in 20 years.",
        "content": null,
        "pubDate": "2023-12-24 19:33:07",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "canada",
            "singapore",
            "united states of america",
            "india",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "34b614b3d4bdf4a904ade7d82fd4a109",
        "title": "Jets owner: Coach Saleh, GM Douglas to return",
        "link": "https://www.espn.com/nfl/story/_/id/39178073/jets-woody-johnson-robert-saleh-joe-douglas-return-24",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Jets are planning to retain general manager Joe Douglas and coach Robert Saleh, owner Woody Johnson told the New York Post on Sunday.",
        "content": "EAST RUTHERFORD, N.J. -- Despite missing the playoffs for the 13th consecutive season, the are planning to retain general manager Joe Douglas and coach Robert Saleh, owner Woody Johnson said Sunday in a newspaper interview. \"My decision is to keep them,\" Johnson before his team faced the at MetLife Stadium. \"I think we've had some very positive moves. The culture of the team is a lot better. The defense is better. The offense needs a few pieces.\" The announcement came as no surprise. There was never any indication that Douglas and Saleh were in serious jeopardy, with sources saying in recent days that Johnson was leaning toward the status quo. This comes five days after quarterback , who wields considerable influence within the organization, delivered strong endorsements for Douglas, Saleh and offensive coordinator Nathaniel Hackett during his weekly appearance on \"The Pat McAfee Show.\" Essentially, Johnson is giving his top leaders a mulligan after losing Rodgers to a torn Achilles in the first game. It sent the Jets (5-9) into a tailspin, resulting in their eight straight losing season. \"Just to keep the continuity going with Aaron and the team we've got,\" Johnson told the newspaper, explaining his decision. \"Like I said a year ago, we need a quarterback. We had a quarterback for four plays. Since then, we haven't been able to replace him. If we have a good quarterback, it makes everybody's job easier. It makes the line better, the receivers better.\" Given Rodgers' strong public support for Douglas and Saleh, it would've been cumbersome for Johnson to make sweeping changes at the top of organization. Rodgers said he wants to play at least two more seasons, putting ownership in the position of having to keep the 40-year-old quarterback happy. At the same time, Johnson has been understanding and supportive behind the scenes, sources said. He is not happy with the results, they said, but never has given any indication that jobs are on the line. The Jets fancied themselves as a Super Bowl contender before the Rodgers injury. With a healthy Rodgers in 2024, they expect to be in the same position. Saleh's record is 16-23. Douglas, hired in June 2019, is 25-55.",
        "pubDate": "2023-12-24 17:59:38",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "india",
            "united states of america",
            "australia",
            "singapore",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "a4836a6775c0901d9ace3287e970e92a",
        "title": "Bills boost playoff chances with late victory vs. Chargers",
        "link": "https://www.espn.com/nfl/story/_/id/39176597/buffalo-bills-beat-los-angeles-chargers-boost-playoff-chances",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "A Tyler Bass field goal with 28 seconds left sealed the crucial win for Buffalo Saturday night at SoFi Stadium.",
        "content": "INGLEWOOD, Calif. -- The defeated the 24-22 to keep their bid for the playoffs alive and well at SoFi Stadium on Saturday. The Chargers, playing their first game since firing coach Brandon Staley and general manager Tom Telesco last week, got five field goals from and briefly took the lead late in the fourth quarter. But a field goal with 28 seconds left sealed the win for Buffalo. The victory moved the Bills to 9-6 on the season with two crucial games to play against the and . The Chargers dropped to 5-10. It was far from pretty, and the team that destroyed the six days ago was hard to find in this Bills performance. But, the Bills did just enough to get a needed victory despite a variety of mistakes and the defense allowing Chargers backup quarterback to put together four straight field goal drives in the third and fourth quarters. The defense, which held the Chargers to just one touchdown, came up big. Additionally, a critical stop at the end of the game -- which has been a problem for the defense at times this year -- and the offense converting longer drives into touchdowns were the difference. Though reached single-season milestones with his passing touchdown and two rushing touchdowns in the game, he didn't put together one of his better performances, completing 15-of-21 passes for 237 yards. There's work to be done for a Bills team with sights set beyond making the playoffs, but it was a game they had to win and did. Underwhelming performance. After a blowout win against the Dallas Cowboys, the Bills put together a less than stellar outing -- especially with each game crucial for Buffalo's odds of making the playoffs -- against a Chargers team that has struggled on defense and had a backup quarterback starting. . This isn't to say this wasn't a big game for Davis (four receptions, 130 yards and a touchdown), but there is just not any precedent to him continuing this success over consecutive games. Coming into this game, Davis did not have a reception in three of the last four games (with a six reception, 105-yard performance vs. the in between) on three total targets. If he can use this as an opportunity to string big games together, that would be significant for the offense, but is something that still needs to be proven. being unreliable with the football. The second-year back had a breakout performance last week against the Cowboys, but he fumbled twice versus the Chargers, losing one of them in the fourth quarter, and has dropped likely touchdown catches twice in the last month. His only other fumbles of the season came against the Broncos, but ball security and consistency with the football are becoming an issue. Allen's 57-yard touchdown pass to wide receiver Gabe Davis in the second quarter. While the game remained close, the play was key to get the Bills offense going. The one-play drive came on the fourth drive of the game for Buffalo and more than doubled any net yardage they had accomplished on a single drive prior to that. The pass by Allen traveled 38 air yards downfield, his longest such touchdown of the season. vs. New England Patriots (Sunday, 1 p.m. ET) The Chargers looked like a team with their minds set on the offseason when they were blown out by the middling Raiders 63-21 on \"Thursday Night Football.\" They struggled to score. Their defense couldn't secure a stop. They turned the ball over a season-high five times. The loss, so embarrassing, that it resulted in the firings of Staley and Telesco with three games remaining. But on Saturday, the Chargers, a team with nothing to play for, battled with the Bills, whose playoff hopes were on the line in the Chargers first game under interim head coach Giff Smith. .'s usage. James, who the Chargers signed to a four-year $76.5 million contract in 2022, had established himself as one of the league's best safeties since being drafted in 2018, earning first team All-Pro honors as a rookie. Under former coach Brandon Staley, the Chargers used James in various places across the defense, from outside linebacker to slot cornerback, but James' home mainly was at safety. In James' first game since Staley's firing, James played his first snap at safety on the Bills' final offensive drive of the fourth quarter. Dicker. The Chargers' special teams unit has been this team's most reliable all season, in large part due to Dicker. Saturday night, he had his best game of the season, nailing a career-high five field goals, including a 53-yarder to give the Chargers a one-point lead in the fourth quarter. The Chargers had their first 10-point lead since Week 9. The Chargers jumped out to a 10-point lead in the second quarter, their first lead since Week 13. Playing with a third-string center and a backup quarterback, the Chargers looked like a confident offense against a Bills defense that held one of the league's best offenses in the Dallas Cowboys to just 10 points a week ago. at (Sunday, 4:25 p.m. ET)",
        "pubDate": "2023-12-24 04:25:06",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "australia",
            "india",
            "united states of america",
            "singapore",
            "canada",
            "united kingdom"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "5166f7b3e5768adbb1e8e1410e7682ca",
        "title": "'Ready' Rudolph rocks Bengals, Steelers stop skid",
        "link": "https://www.espn.com/nfl/story/_/id/39176357/mason-rudolph-makes-most-start-pittsburgh-steelers-win",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "With 290 passing yards and two touchdowns in the Steelers' 34-11 win over the Cincinnati Bengals -- the team's first victory by more than one score all year -- Pittsburgh veteran quarterback Mason Rudolph helped improve his club's playoff hopes Saturday.",
        "content": "PITTSBURGH -- Sitting at the dais in the ' press conference room inside Acrisure Stadium, quarterback admitted that he'd let his mind wander into the what-ifs. What if Saturday was one of his final opportunities to prove he could make it as an NFL quarterback? After six rollercoaster seasons with only 18 starts -- and just two in the last three years -- did he truly belong in the league? With 290 passing yards and two touchdowns with no interceptions in the Steelers' resounding 34-11 victory against the -- the team's first win by more than one score all year -- Rudolph proved to himself and a stadium of more than 66,000 that he can play winning football in the NFL. \"You got confidence in yourself as a player,\" Rudolph said, \"but you're kind of thinking, 'Am I going to jump into the commercial real estate realm next year or am I going to be playing quarterback?'\" Rudolph, who's been inactive for all but three games this season, made the most of his first start since Week 10 of the 2021 season from the jump. On the Steelers' second play of the game, Rudolph connected with wide receiver on a short throw, and Pickens took it 86 yards to the house for the Steelers' longest touchdown since Ben Roethlisberger hit for a 97-yard touchdown in Week 12 of the 2018 season. \"A fast start no matter whether you're in high school, college or pro, it makes a difference, and especially when we're at this venue at home gets the crowd into it, to get a guy like George going early and his run after catch ability, it's just second to none,\" Rudolph said. \"So it was a pretty cool view as I tried to chase him down from behind.\" Aided by the 86-yard touchdown, Rudolph threw for 130 yards in the first quarter, the most by a Steelers quarterback in any quarter since threw for 138 yards in the 4th quarter against the Rams in Week 7. Rudolph orchestrated two more touchdown drives that half and helped the Steelers cap the second quarter with a field goal when he hit Pickens for a 44-yard completion on third-and-long. Pickens made a toe-tapping grab to keep the drive going, preventing the Bengals from getting the ball with time to work before half. The throw traveled 44 air yards, making it the longest throw of the season by a Steelers' quarterback -- and the longest throw by a Steelers' quarterback since Rudolph connected with on a pass that traveled 47 air yards in Week 17 of the 2020 season. In the third quarter, Rudolph found Pickens again, this time for a 66-yard touchdown. Three of the duo's connections went for at least 40 yards, marking the first time since Rudolph's start against the Browns in 2020 that the Steelers' offense has had at least three plays of 40 yards or more. In the previous five games, the Steelers had just two total plays that went for at least 40 yards. \"Coach (Mike Tomlin) talked about it earlier this week that we got to be able to take those shots and kind of let our nuts hang out there,\" center said. \"There just ain't nothing to lose. Good to see the success down there, and good to see us complete those shots. It changed the game for us.\" With Rudolph at quarterback, the Steelers also scored their most points in a game since 2021 and had their highest yards per play average (6.8) since 2018. \"He was Mason,\" Tomlin said. \"We talked about it early in the week. He's got a belief in himself. He's aggressive in his play style, and I thought he did a really good job not displaying a lot of rust for a guy who hadn't played obviously a lot.\" As he raced down the field to celebrate with his teammates following the 66-yard touchdown, Rudolph looked up in the crowd and found his parents. His dad last saw him play in person in 2021 when he caught a red-eye on short notice to watch his son get the start when Ben Roethlisberger went on the reserve/COVID-19 the night before the game. His mom, meanwhile, last cheered him on in-person at the final regular-season game of the 2020 season. Not only did his family watch him play -- and win -- on Saturday, they also heard the crowd chant Rudolph's name throughout the night, including four times in the fourth quarter. Once maligned for his inconsistent play and tumultuous 2019 season, Rudolph was celebrated by a crowd that's had little reason to be excited recently. \"We're all human,\" Rudolph said. \"I'd be lying if I said I didn't enjoy it or I didn't like it, but it's a week-to-week league. I've been on the other end of it, so you try to block it out and play the game. ... We've got a bunch of passionate fans, and what a joy to play in front of them tonight, last home game while my family in town. It was amazing.\" Tomlin said it was too early to ask about the starting quarterback for the Week 17 game against the , but Rudolph made a strong case to retain the job for another week as Kenny Pickett recovers from TightRope surgery following a high right ankle sprain. \"Listen, I play this game to play,\" Rudolph said, asked if he'd earned another start. \"I'd love to play, but that's out of my hands. I'll find out the marching orders as we go.\" After the game, defensive captain gave Rudolph the game ball. \"Mason was ready for the moment,\" Heyward said. \"Three games we've lost in a row. Personally, I just felt like with everything going on, Mason attacked. There wasn't any sitting back and letting things happen. He went out there and attacked the game. You saw a couple of times with third-and-one throwing it deep and giving guys a chance.\" So was beating the Bengals and getting his first game ball the best Christmas present he's ever received? \"I don't know,\" Rudolph said, grinning. \"I got a tree house when I was like 12, which was pretty cool, but this is definitely up there.\"",
        "pubDate": "2023-12-24 03:31:55",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "india",
            "united kingdom",
            "australia",
            "singapore",
            "united states of america",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "8b081ded8f311cb8cce700b7c0cafbe1",
        "title": "Stalled out: Pistons' 26th straight loss ties record",
        "link": "https://www.espn.com/nba/story/_/id/39176319/stalled-pistons-26th-straight-loss-ties-nba-record",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Detroit Pistons matched the NBA record for the longest losing streak in a single season, falling to the Nets on Saturday for their 26th straight.",
        "content": "NEW YORK -- The matched the NBA record for the longest losing streak in a single season, falling 126-115 to the on Saturday night for their 26th straight defeat. The Pistons joined the 2010-11 and 2013-14 , dropping to 2-27 in their first season under Monty Williams. They were in the game in the second half before the Nets put them away with a 15-0 run to open a 21-point lead and ensure that Detroit would remain winless since Oct. 28. The teams will meet again Tuesday night in Detroit, with the Pistons nearing the overall longest skid in league history. The 76ers lost 28 consecutive games from late in the 2014-15 season through early 2015-16. had 29 points, seven assists and six rebounds for the Nets, who had seven players in double figures and snapped their five-game losing streak. scored 20. The Pistons are now tied for the second-longest losing streak in NBA, NFL, NHL and MLB history. The Sixers' 28-game losing streak in 2015 spanned multiple seasons. The Nets shot 52% from the field, showing plenty of energy in their second night of back-to-back games after losing to the NBA champion on Friday. They got easy baskets thanks to the Pistons, whose 14 turnovers led to 22 points. The Pistons were within two midway through the third quarter before a quick seven straight points by the Nets pushed the lead back to nine. It was still just 88-82 with under three minutes remaining, but made a 3-pointer and followed with consecutive baskets to trigger a 10-0 finish to the period that made it 98-82. Thomas scored the first five of the fourth quarter to make it 103-82, giving the Nets their largest lead. scored 23 points for the Pistons, who started 2-1 in their first season under Williams before their freefall toward infamy. finished with 22 points after being limited to just 11 minutes in the first half after picking up three fouls. Williams, the NBA Coach of the Year in Phoenix in 2021-22, said he was the one to blame before the game. But the bigger problem might be a roster whose average age is slightly under 25 years old, making the Pistons one of the youngest teams in the league. They foul too much (most in the league with 22.8 per game) and turn it over too often (29th, with 16.6 per game) and just haven't been able to overcome the combination. Detroit started with a couple nice possessions in jumping to a 6-0 advantage but got careless, turning it over six times in the first quarter. The Nets cashed those in for 11 points, which was the margin when the quarter ended with Brooklyn ahead 32-21. The Pistons played better in the second quarter but could only cut two points off the deficit, trailing 65-56 at the break.",
        "pubDate": "2023-12-24 03:31:55",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "india",
            "united kingdom",
            "australia",
            "singapore",
            "united states of america",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "36e50f38534845398626f48bc44374b1",
        "title": "Josh Allen scrambles, then finds Gabe Davis for 57-yard Bills TD",
        "link": "https://www.espn.com/nfl/story/_/id/39175968/buffalo-bills-josh-allen-finds-gabe-davis-57-yard-touchdown",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "On first down from Buffalo's 43-yard line, Allen found Davis for a big second-quarter TD.",
        "content": "INGLEWOOD, C.A. -- It took the ' offense some time. But on the team's fourth drive of the game against the , only one play was needed for the offense to go 57 yards and pick up a touchdown. On first down from the Bills' 43-yard line, quarterback stepped back, scrambled to his right and located wide receiver downfield with linebacker Kenneth Murray trailing him. Allen put the pass in the right spot for Davis who caught the ball and ran into the end zone. The touchdown brought the Bills within three points after the Chargers took advantage of some early miscues by Buffalo to take a 10-0 lead. Prior to the play, Allen was 1-4 for 17 yards on throws of five or more air yards. The touchdown pass was thrown 38 air yards downfield, Allen's longest such touchdown of the season. Davis, who had not caught a pass in the last two games on three targets, had two receptions for 74 yards after the touchdown on four targets. One play. 57-yards. Touchdown Buffalooooo! 📺: | |",
        "pubDate": "2023-12-24 02:21:28",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "australia",
            "india",
            "united kingdom",
            "canada",
            "singapore",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "f4ecc1e8b444e791a2dc9ad2089c2a22",
        "title": "Joshua dominates as Wallin's corner stops fight",
        "link": "https://www.espn.com/boxing/story/_/id/39175218/anthony-joshua-dominates-otto-wallin-corner-stops-fight",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Anthony Joshua busted up Otto Wallin's nose and eyes in a strong performance that forced Wallin's corner to stop the bout before the start of Round 6 on Saturday.",
        "content": "Anthony Joshua's slow reboot of his career is complete after a sharp display forced Otto Wallin's corner to stop the fight after a punishing fifth round Saturday at the Kingdom Arena in Riyadh, Saudi Arabia. Joshua, a former world heavyweight champion, was full of menace and back to his destructive best as he broke down Wallin, whose corner threw in the towel before the start of the sixth round. Joshua was more aggressive than he was in the early rounds in his previous bout against Robert Helenius in August, and after a sharp start he left Wallin busted up to the nose and eyes. Joshua (27-3, 24 KOs), 34, who lives in north London, England, and Deontay Wilder were on a collision course to meet in a megafight on March 9, but those plans were ruined by Wilder's feeble display and wide points defeat to Joseph Parker earlier on the card in Saudi Arabia. But big things are still on the horizon for Joshua in 2024. The IBF world title could become vacant after the undisputed title showdown between Oleksandr Usyk and Tyson Fury on Feb. 17, and Joshua is likely to fight for it against Croatia's Filip Hrgovic, who also fought on the undercard Saturday and registered an easy win. Joshua was moody in media interviews over the past week and admitted \"there is no future\" if he failed to beat Wallin. But he emphatically quashed theories that he is unravelling under pressure and expectations. Joshua is on a mission to become a three-time world champion, and his third win since a second consecutive points loss to Usyk in a world title fight in 2022 continues his upward curve in form. \"Throughout the build-up, I was telling everyone I had to focus on the man in front of me,\" Joshua said in the ring afterward. \"Not so much a throwback fight but another day at the office. The corner plays a big role so the fighter can fight another day. \"I'm on a journey and I'm going to stay focused. I don't celebrate when we win these fights, I celebrate when I win the titles.\" Essex, England-based trainer Ben Davison was in Joshua's corner Saturday, with Texas-based Derrick James unavailable. Davison, Fury's former trainer, is the fourth trainer Joshua has worked with since 2021. \"I'm searching for greatness, and Ben Davison is a really good addition to my team,\" Joshua said. \"They have helped me develop in a short space of time.\" Joshua did not dismiss a future fight with Wilder, but his promoter, Eddie Hearn, spoke afterward about a potential Joshua-Hrgovic fight for the vacant IBF belt. Joshua compared Wilder's situation to that of Daniel Dubois, who rebounded by defeating Jarrell Miller on the undercard Saturday after losing to Usyk in August. \"You can do anything, and if [Wilder] wants to come back he can do it,\" Joshua said. Joshua started well, jabbing to the body and landing two right crosses in the second round that left Wallin bleeding from the nose. Joshua boxed tidily behind his jab, and in the third round he landed with a lunging right to the body as well as a left hook to the head. When Wallin (26-2, 15 KOs), 32, from Sweden but based in New York, missed with a punch, Joshua almost connected with a counter big right hand in the fourth round. He was getting closer and in total control. In the fifth round, Joshua landed a right followed by a big left hook that left Wallin staggering across the ring. With blood streaming from various wounds, Wallin's corner called the fight off before the start of the sixth round. It was Joshua's best performance in at least five years, and arguably his best since he stopped former long reigning world champion Wladimir Klitschko in 2017.",
        "pubDate": "2023-12-24 00:16:54",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "canada",
            "united kingdom",
            "singapore",
            "india",
            "united states of america",
            "australia"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "c84bd799558c14e450a59d65d24cb6bf",
        "title": "Steelers' offense firing on all cylinders with three first-half touchdowns vs. Bengals",
        "link": "https://www.espn.com/nfl/story/_/id/39174355/pittsburgh-steelers-george-pickens-mason-rudolph-highlight",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "With Mason Rudolph back under center in Pittsburgh, the Steelers' offense unleashed its firepower.",
        "content": "PITTSBURGH -- It's a holiday miracle. With ' second-quarter touchdown, the lead the 21-0 with just more than seven minutes until halftime, their first 21-point lead since the 2020 season. Now finds pay dirt. are dominating, 21-0 in the first half. 📺: on NBC 📱: Stream on Harris' rush added to earlier touchdowns scored by and . Earlier this week, coach Mike Tomlin announced would take over the starting job in an effort to score more points. was inactive on Saturday, still sidelined following Dec. 4 ankle surgery. Rudolph certainly started off hot, completing 6 of 9 attempts for 121 yards and a touchdown as he orchestrated three scoring drives, aided by two defensive interceptions. On just the second play of the game, Rudolph sent a laser pass to Pickens, who cut inside and outran cornerback . Pickens then slipped by the Bengals' secondary when safety missed a tackle. The second-year wide receiver, who was the topic of conversation in Pittsburgh this week for admitting he didn't block on a play because he didn't want to get hurt, raced 86 yards down the field for a massive touchdown. 86-YARD TOUCHDOWN ‼️ 📲: Stream on NFL+ The touchdown from Rudolph to Pickens marked the Steelers' longest touchdown since Week 12 of 2018 against the when Ben Roethlisberger hit for 97 yards, according to ESPN Stats and Info. The Steelers also scored a 7-yard rushing touchdown from Austin Iearly in the second quarter. The are off to a hot start. Calvin Austin extends the lead to 14-0. 📺: on NBC 📱: Stream on",
        "pubDate": "2023-12-23 23:56:23",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "united kingdom",
            "australia",
            "india",
            "canada",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "5d45e7528ae2663148652030a4555db9",
        "title": "Kill steps down, Sanchez named HC at NMSU",
        "link": "https://www.espn.com/college-football/story/_/id/39174620/sources-new-mexico-st-head-coach-jerry-kill-stepping-down",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "A week after New Mexico State's bowl loss to Fresno State, head coach Jerry Kill has stepped down as head coach of the Aggies, the school announced Saturday.",
        "content": "Two years into an unlikely resuscitation of football program, coach Jerry Kill is stepping down, sources told ESPN. Kill's decision came in recent days, and the school has already found an internal replacement in wide receivers coach Tony Sanchez, sources told ESPN. Sanchez is the former head coach at . Kill led New Mexico State to one of the sport's most distinct turnarounds in the last decade, as they went 17-11 in his two years as head coach. That included back-to-back bowl appearances and a 10-5 season in 2023, the school's first double-digit win season since 1960. The New Mexico State team was set to learn the news on Saturday afternoon in a team meeting, per sources. Kill is a veteran head coach with stops at Minnesota, Northern Illinois and Southern Illinois, among others. He also worked as an administrator and has been an assistant at Rutgers, Virginia Tech and TCU. Sanchez is a former successful head high school coach in the Las Vegas area who served as UNLV's head coach for five years from 2015 to 2019. Sanchez went 20-40 in that time, with his tenure remembered best for key off-field strides in facilities and support to help modernize the program. New Mexico State had lost both offensive coordinator Tim Beck and defensive backs coach Cliff Odom since losing to Fresno State in the New Mexico Bowl on Dec. 16. The move to Sanchez could help keep continuity and momentum in both the staff and the program.",
        "pubDate": "2023-12-23 23:52:58",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "united kingdom",
            "australia",
            "india",
            "canada",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "89bbc39542f6cc193037f927e2748523",
        "title": "Parker upsets Wilder via unanimous decision win",
        "link": "https://www.espn.com/boxing/story/_/id/39174772/joseph-parker-upsets-deontay-wilder-unanimous-decision-win",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Joseph Parker pulled off a massive upset on Saturday night, thoroughly outboxing fellow heavyweight contender Deontay Wilder en route to a unanimous decision victory Saturday night in Riyadh, Saudi Arabia.",
        "content": "Joseph Parker dominated Deontay Wilder on Saturday in Riyadh, Saudi Arabia, en route to the major upset in a battle of former heavyweight champions. New Zealand's Parker prevailed via scores of 118-111, 118-110 and 120-108. Wilder entered the bout a -700 favorite, per ESPN BET, and did so with a deal in place to meet Anthony Joshua on March 9 in Riyadh, sources said. That agreement was contingent on Wilder and Joshua both winning. Parker's win over Wilder, which spoils those plans, was the co-feature to Joshua vs. Otto Wallin. \"Coming into this fight, everyone had other plans, but this is God's plan,\" said Parker, ESPN's No. 8 heavyweight. ... \"Today, what a win. Merry Christmas to us.\" Parker's strategy was a wise one: to avoid Wilder's dangerous right hand and force Deontay to respect his foe's power. Parker (34-3, 23 KOs) timed Wilder early and often with looping right hands over the top. The game plan seemingly made Wilder reluctant to unload his trademark reckless right hand that always finds its mark. But at 38 and with only one round of activity since November 2021, Widler admitted his \"timing was off a little bit.\" \"He did a great job avoiding a lot of my punches,\" said Wilder, ESPN's No. 3 heavyweight. \"We make no excuses tonight. It was a good fight and we move onto the next thing.\" What the future holds is unclear now that plans to fight Joshua are spoiled. Wilder's long heavyweight title reign ended in 2020 when he rematched Tyson Fury. Following the seventh-round TKO defeat, Wilder (43-3-1, 42 KOs) was knocked out in Round 11 by Fury of the heavyweight championship trilogy bout that was named ESPN's 2021 Fight of the Year. Wilder earned a first-round knockout of Robert Helenius last October but hadn't fought since. And when he did step through the ropes, he looked sluggish and gun-shy. Parker defeated Andy Ruiz in 2016 to win a vacant heavyweight title but lost the WBO belt to Joshua in 2018. The 31-year-old was knocked out by Joe Joyce in September 2022, but rebounded with three victories in 2023 before fighting his toughest opponent. \"He did catch me a few times and it's a very hard right hand,\" Parker said. But it was Parker who landed the bigger shots against one of the division's all-time punchers. In Round 8, Parker connected with an overhand right that buckled Wilder and forced him to hold on. Fury found similar success with looping shots during his three fights with Wilder, and Parker said his training mate helped him prepare with his experience. \"I'm back,\" Parker said.",
        "pubDate": "2023-12-23 23:52:58",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "singapore",
            "united kingdom",
            "australia",
            "india",
            "canada",
            "united states of america"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "cb9bdca645e4e6592dedd9c51a570165",
        "title": "Joshua-Wallin, Wilder-Parker live results and analysis",
        "link": "https://www.espn.com/boxing/story/_/id/39167942/joshua-wallin-wilder-parker-boxing-live-results-analysis",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Anthony Joshua takes on Otto Wallin, and Deontay Wilder squares off against Joseph Parker. Follow live.",
        "content": "A full day of fights headlined by Anthony Joshua vs. Otto Wallin and Deontay Wilder vs. Joseph Parker will take place Saturday at Kingdom Arena in Riyadh, Saudi Arabia ( ). Joshua (26-3, 23 KOs), a former unified heavyweight champion, is fighting for the third time this year. He has earned two consecutive victories -- over Jermaine Franklin and Robert Helenius -- following back-to-back defeats to Oleksandr Usyk. Wallin (26-1, 14 KOs) gave Tyson Fury a tough fight in 2019 but lost a unanimous decision, the only loss of his career. He has won six consecutive fights since, including an impressive decision victory over Murat Gassiev back in September. Top Rank Boxing is now on ESPN and . to get , weigh-ins and more. Anthony Joshua vs. Otto Wallin and Deontay Wilder vs. Joseph Parker In the co-main event, Wilder will fight for the first time this year against Parker in a battle of former heavyweight champions. Wilder (43-2-1, 42 KOs), the former WBC titleholder, last fought in October 2022, a first-round KO victory over Helenius. That's the only round Wilder has fought since his loss to Fury in their trilogy match in October 2021. Parker (33-3, 23 KOs) won the WBO title in 2016, and after two defenses, he lost it to Joshua in 2018. He has won two of his past three fights by stoppage. Also on the card, Dmitry Bivol defends his WBA light heavyweight title against Lyndon Arthur, and Daniel Dubois takes on Jarrell Miller in a 10-round heavyweight bout. Stay here for fight updates, results and round-by-round analysis from Mike Coppinger and Nick Parkinson.",
        "pubDate": "2023-12-23 20:54:27",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "0679f472a161f3a83ead7bd67d480e69",
        "title": "Michigan State backup shot in leg in hometown",
        "link": "https://www.espn.com/mens-college-basketball/story/_/id/39173900/michigan-state-jeremy-fears-jr-shot-leg-hometown",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Michigan State freshman guard Jeremy Fears Jr. suffered non-life-threatening injuries when he was shot in the leg in his hometown, according to the school.",
        "content": "men's basketball freshman suffered nonlife-threatening injuries from a gunshot wound near his hometown of Joliet, Illinois, the school announced Saturday. Fears was shot in the leg late Friday or early Saturday. The school said he underwent surgery Saturday but did not offer details surrounding the circumstances of the shooting. An officer with the Joliet Police Department told ESPN that a public information officer was unavailable to discuss the shooting because of the holiday weekend. \"Jeremy underwent surgery this morning and is resting comfortably,\" Michigan State coach Tom Izzo said in a statement. \"While there is much we still don't know, my focus is on supporting Jeremy on his road to recovery.\" Fears, a four-star prospect in the 2023 class, is averaging 3.5 points. The shooting is the latest incident of gun violence to impact the program. Earlier this year, three students were killed in a mass shooting on Michigan State's campus when a gunman entered two buildings and opened fire before he died of a self-inflicted gunshot wound. In the Spartans' first game after the shooting, a section of the Breslin Center was left open to honor the victims. Michigan State (7-5) faces in East Lansing on Dec. 30.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "812635f41adfa8c52a77fe9e1a1c5a6b",
        "title": "Jags' Lawrence clears protocol, will start vs. Bucs",
        "link": "https://www.espn.com/nfl/story/_/id/39173486/jaguars-trevor-lawrence-clears-protocol-start-vs-bucs",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Jacksonville Jaguars quarterback Trevor Lawrence has cleared the NFL's concussion protocol and will start Sunday's game against the Tampa Bay Buccaneers, the team announced.",
        "content": "JACKSONVILLE, Fla. -- quarterback has cleared the NFL's concussion protocol and will start Sunday's game against the , the team announced. Lawrence practiced on a limited basis Friday -- the first time he had been on the field this week and traveled with the team to Tampa on Saturday. Coach Doug Pederson said Friday that if Lawrence hadn't cleared the protocol by the time the team left for Tampa he wouldn't make the trip and backup would start. Instead, Lawrence will make his 49th consecutive start, which is tied with for the second-longest active streak among quarterbacks behind (85). Pederson said Lawrence suffered the concussion on a scramble up the middle with five minutes remaining in the Jaguars' 23-7 loss to Baltimore last Sunday. Lawrence did not leave the game but completed only one of his seven pass attempts after that play. Pederson said Lawrence self-reported symptoms after the game and was placed in the concussion protocol. Lawrence did not practice on Wednesday or Thursday. Lawrence has completed 65.9% of his passes for 3,525 yards and 18 touchdowns with 10 interceptions this season. The Jaguars (8-6) have lost three in a row and are tied atop the AFC South with Houston and Indianapolis. This is the third injury for Lawrence in 2023, but none have cost him a game. He suffered a sprained left knee late in the Jaguars' victory over Indianapolis in Week 6, but he didn't miss a start and led the Jaguars to a victory over the four days later on a Thursday night. He suffered a high ankle sprain against Cincinnati on Dec. 4 but started the following week in Cleveland.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "4794abf8a50148202d9f4d6d87de6bfb",
        "title": "Ex-Hurricanes WR Young transferring to Georgia",
        "link": "https://www.espn.com/college-football/story/_/id/39173507/former-miami-wr-colbie-young-transferring-georgia",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Georgia coach Kirby Smart dipped into the transfer portal for another wide receiver Saturday, adding Miami's Colbie Young.",
        "content": "coach Kirby Smart dipped into the transfer portal for another wide receiver Saturday, adding 's . Young, a junior from Binghamton, New York, will have one season of eligibility left with the Bulldogs. He had 79 receptions for 939 yards with 10 touchdowns the past two seasons at Miami. Young also considered Penn State and Wisconsin as transfer destinations. \"Thank you Miami coaches and teammates for everything,\" Young wrote on Instagram. \"Y'all made the experience amazing and I'm extremely grateful. Thank you to my agent, family, friends, etc. for supporting me through this decision. With that being said I have decided to transfer and am committing to [the] University of Georgia.\" Young, 6-foot-5 and 215 pounds, is the second wide receiver to announce his intentions to transfer to Georgia. Vanderbilt's , who had 22 receptions for 439 yards in 2023, also is joining the Bulldogs. South Carolina defensive lineman announced Friday that he's transferring to Georgia. The former four-star recruit was the No. 134th-ranked prospect in the 2023 ESPN 300. It's the second year in a row the Bulldogs have shored up their receiver depth through the transfer portal. Last year, Georgia added Mississippi State's and Missouri's . The Bulldogs are expected to lose senior (who has one season of eligibility left) and possibly junior , who hasn't yet announced whether he'll return to school or enter the 2024 NFL draft.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "035a165be1ff465c874b237efdf07094",
        "title": "Bears' Santos kicks off holiday with new contract",
        "link": "https://www.espn.com/nfl/story/_/id/39173028/bears-pk-cairo-santos-gets-4-year-16m-extension-source-says",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Bears have signed veteran kicker Cairo Santos to a four-year extension, with a source telling ESPN that the $16 million deal includes $9.5 million guaranteed.",
        "content": "The have signed veteran kicker to a four-year extension, with a source telling ESPN's Adam Schefter that the $16 million deal includes $9.5 million guaranteed. The Bears announced the extension Saturday without disclosing financial terms. \"It is great to extend Cairo for another four years,\" general manager Ryan Poles said in a statement. \"His consistency and dependability will help us continue to elevate.\" Santos, 32, has served as the Bears' kicker since the 2020 season. He has made 104 of 114 field goal attempts in that span, including 27-of-29 this season. His 30 field goals made in 2020 set a franchise record. The new contract ties Santos to Chicago through the 2027 season. Santos had been playing on the final year of the extension he signed after he set the Bears' single-season record by making 93.8% of his field goals in 2020. Santos surpassed longtime Bears kicker Robbie Gould as the most accurate kicker in franchise history and has made 91.2% of his field goal attempts since rejoining the Bears in 2020. (Santos' first stint in Chicago came during the 2017 season when he appeared in two games.) He was named the NFC's special teams player of the month in November when he went 12-for-14 on field goals and 5-for-5 on extra points. He also led the NFL in field goals made, field goals attempted and in points (41). Santos has also kicked for the , , and over a 10-year career. Santos' extension isn't the only item on Poles' to-do list as the Bears near the start of the offseason. Cornerback , who following the 2023 season, is a pending free agent. The Bears and Johnson could not come to an agreement on an extension earlier this season, nor was the cornerback moved at the deadline after requesting a trade in October. Johnson is tied for the team lead with four interceptions.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "acec80c1ad31666475124f93eebf6e0a",
        "title": "Sources: Johnson nears return for sinking Hawks",
        "link": "https://www.espn.com/nba/story/_/id/39173451/hawks-jalen-johnson-nears-return-month-sources-say",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Hawks forward Jalen Johnson, whose breakout season was interrupted by a left wrist injury, could return as soon as Tuesday night against the Bulls, sources told ESPN.",
        "content": "After missing a month with a left wrist injury, there is optimism that forward could return as soon as Tuesday night against the , sources told ESPN. Johnson had been enjoying a breakout season for the Hawks, averaging career highs with 14.1 points, 7.3 rebounds and 2.4 assists in 15 games before the injury. Johnson was recently cleared for a full contact return to practice. The Hawks are 4-9 without Johnson and 29th in defensive efficiency. Atlanta is 12-16 and 11th in the Eastern Conference entering Saturday. Johnson was the 20th overall pick out of in the 2021 NBA draft.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "5e89c371be60259b488de96cf5ac9393",
        "title": "UConn's Clingan out 3-4 weeks with foot injury",
        "link": "https://www.espn.com/mens-college-basketball/story/_/id/39173855/uconn-center-donovan-clingan-3-4-weeks-foot-injury",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "UConn sophomore Donovan Clingan will miss 3-4 weeks with an injury to a tendon in his right foot, the school announced Saturday.",
        "content": "sophomore will miss 3-4 weeks with an injury to a tendon in his right foot, the school announced Saturday. Clingan suffered the injury early in the second half of the Huskies' loss to on Wednesday, going back to the locker room and not returning. UConn coach Dan Hurley said after the game that Clingan had a sprained ankle, but Clingan underwent an MRI to find out the full extent of the injury. \"He didn't have a ton of swelling, but he did have some pain,\" Hurley said on Friday. \"He obviously wanted to go back in [on Wednesday] and then it tightened up on him. We'll see how he feels in the morning and then get the MRI scans.\" This is the second significant foot injury Clingan has suffered in recent months, after suffering a foot strain at a September practice and missing most of the preseason. A 7-foot-2 center from Bristol, Connecticut, Clingan is ranked No. 8 in ESPN's NBA draft rankings. He backed up star big man Adama Sanogo last season and was pegged for a breakout campaign this season as a sophomore. Clingan is averaging 13.9 points, 6.3 rebounds and 2.0 blocks this season, and had 14 points and seven boards in just 14 minutes against Seton Hall before suffering the injury. He also had 21 points and eight rebounds in a win over last week. Without Clingan, Hurley will need to lean on redshirt sophomore , who has shown flashes in a reserve role behind Clingan so far this season. He had 15 points and eight rebounds in a November win over when Clingan was saddled with foul trouble and limited to 13 minutes. No. 5 UConn (10-2, 0-1 in the Big East) hosts on Saturday night.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "f1d4135e478cf73283710ead226c17e4",
        "title": "Chiefs WR Toney, RB McKinnon out vs. Raiders",
        "link": "https://www.espn.com/nfl/story/_/id/39173816/chiefs-rule-kadarius-toney-jerick-mckinnon-vs-raiders",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Kansas City Chiefs ruled wide receiver Kadarius Toney and running back Jerick McKinnon out of their Christmas Day game against the Las Vegas Raiders because of injuries.",
        "content": "KANSAS CITY, Mo. -- The ruled wide receiver and running back out of their Christmas Day game against the because of injuries. Neither player practiced during the week. The Chiefs listed Toney as having a strained hip on their injury report. He is their second-leading wide receiver with 27 catches, but his season has been more notable for costly mistakes. In just the past two weeks, Toney was penalized for lining up offside to nullify what would have been the go-ahead touchdown late in a three-point loss to the , and he deflected a catchable pass to a defender for an interception as the Chiefs were trying to burn the clock and protect the ball in the fourth quarter of a game against the . McKinnon, who has a groin injury, caught one touchdown pass and passed for another one against the Patriots. He is fifth on the Chiefs in receptions with 25 and tied for third in touchdowns with five. McKinnon missed two games earlier in the season, also because of a groin injury. The Chiefs will also play without left tackle , who has a neck injury. Smith has missed the previous two games.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    },
    {
        "article_id": "7027324c18e4fe8defcc20a68caaa028",
        "title": "4th-place Mets hit with record $101M luxury tax",
        "link": "https://www.espn.com/mlb/story/_/id/39173255/mets-hit-record-101m-luxury-tax-last-place-finish",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The New York Mets have been hit with a record luxury tax of nearly $101 million after a disappointing season that saw them finish in fourth place in the NL East.",
        "content": "NEW YORK -- The must pay a record luxury tax of nearly $101 million after a fourth-place finish in their division, among an unprecedented eight teams that owe the penalty for the 2023 season. Owner Steve Cohen's Mets finished with a tax payroll of $374.7 million, according to figures finalized by Major League Baseball on Thursday and obtained by The Associated Press. That topped the previous high of $291.1 million by the 2015 . The Mets' tax bill came to $100,781,932 after they finished fourth in the NL East at 75-87 in the most expensive flop in baseball history. That more than doubled the prior high of $43.6 million by the 2015 Dodgers. The Mets saved about $18 million for this year with their summer selloff that saw them trade , , and . Their projected tax payroll on June 30 was $384 million, according to MLB, and that additional $9.3 million in payroll would have resulted in a tax $8.4 million higher. The final amount owed by the Mets would have been slightly more, but they benefited from a tax credit of $2,126,471 under a provision in the latest collective bargaining agreement for an payroll overcharge involving three players they traded. New York's two-year tax total is $131.6 million. Other teams owing tax money are ($39.7 million), the ($32.4 million), the Dodgers ($19.4 million), ($6.98 million), ($5.5 million), ($3.2 million) and World Series champion ($1.8 million). The Blue Jays, Braves and Rangers are paying tax for the first time. The Yankees and Mets were the only teams to exceed the fourth threshold of $293 million, added in the 2022 labor contract, an initiative dubbed the Cohen Tax and aimed at reigning in Cohen. The previous high for taxpayers was six, in 2016 and last year. This year's tax totaled $209.8 million, more than double the prior record of $78.5 million for 2022. The finished with a tax payroll . The Angels were projected at $231.15 million on June 30 and got under by allowing pitchers , , and along with outfielder to be claimed off waivers on Aug. 31. Texas was projected at $220.2 million on June 30 before boosting its pitching staff by trading for Scherzer, , and and also acquiring catcher . The Rangers' final payroll was $242.1 million. Total spending on luxury tax payrolls rose 12.2% to a $5.79 billion from $5.16 million last year, the previous high. The Yankees have been taxed just under $390 million since the penalties began in 2003, 43% of the $901 million total, followed by the Dodgers at $234 million. Fourteen of 30 teams have owed tax over the two decades. Tax payrolls are calculated by average annual values, including earned bonuses, for players on 40-man rosters along with just over $17.1 million per team for benefits and $1.67 million for each club's share of the $50 million pool for prearbitration players that started in 2022. Deferred salaries and bonus payments are discounted to present-day values. MLB has not finalized regular payrolls, which are based on 2023 salaries and earned bonus plus prorated shares of signing bonuses. Because they owe tax for the third straight year, the Padres and Dodgers pay at a 50% rate on the first $20 million above the $233 million threshold, a 62% rate on the next $20 million and a 95% rate on the amount from $273 million to $293 million. The Mets, Yankees and Phillies owe tax for the second year in a row and pay 30% on the first $20 million over, 42% on the next $20 million, 75% on the third $20 million and 90% on the amount over $293 million. The first $3.5 million of tax money is used to fund player benefits and 50% of the remainder will be used to fund player Individual Retirement Accounts. The other 50% of what's left goes to a supplemental commissioner's discretionary fund intended to be given to teams receiving revenue-sharing money that have grown their non-media local revenue over several years. Next year's initial threshold is $237 million. If the Mets, Yankees, Dodgers, Padres or Phillies go over, they would pay at the highest tax rate, rising to 110% for the amount over $297 million.",
        "pubDate": "2023-12-23 20:32:26",
        "image_url": null,
        "source_id": "espn",
        "source_priority": 18,
        "country": [
            "united kingdom",
            "singapore",
            "australia",
            "united states of america",
            "india",
            "canada"
        ],
        "category": [
            "sports"
        ],
        "language": "english"
    }
]