[
    {
        "article_id": "d753cbb8b809c939587b01748ed5c41f",
        "title": "Christmas Eve shopper numbers fall amid Sunday trading and cost-of-living crisis",
        "link": "https://www.theguardian.com/business/2023/dec/24/christmas-eve-footfall-up-at-retail-parks-but-figures-still-down-30-on-last-year",
        "keywords": [
            "Retail industry",
            "Business",
            "UK news"
        ],
        "creator": [
            "Nadeem Badshah and agency"
        ],
        "video_url": null,
        "description": "Footfall was nearly 7% lower than last week and more than a fifth down on 2022 levelsThe number of in-person shoppers has fallen on Christmas Eve compared to last year amid Sunday trading hours and the cost-of-living crisis.Footfall across all UK retail destinations up to 5pm on Sunday was 6.8% lower than last week, and 20.6% lower than 24 December 2022, the latest data from industry analyst MRI Software shows. Continue reading...",
        "content": "The number of in-person shoppers has fallen on Christmas Eve compared to last year amid Sunday trading hours and the cost-of-living crisis. Footfall across all UK retail destinations up to 5pm on Sunday was 6.8% lower than last week, and 20.6% lower than 24 December 2022, the latest data from industry analyst MRI Software shows. The data also showed footfall remains at least a third lower than levels in 2019, before the Covid pandemic. Jenni Matthews, head of marketing and insights at MRI Software, said: “As Christmas Eve progressed, footfall diminished across all destination types week-on-week, and year-on-year.” Matthews added: “Compared to 2019 levels, footfall remains at least a third lower with a number of factors contributing to this; Sunday trading hours are in operation today which is likely to limit retail trade, and the cost-of-living crisis has impacted many this year which means consumers are likely to have spread the cost of Christmas and started shopping earlier.” Retail parks saw the only week-on-week rise in footfall up to 5pm on Sunday with a 6.7% rise, while the figure dropped for both high streets and shopping centres by 14.8% and 3.0% respectively. This year, many stores and destinations operated normal Sunday trading hours. In some areas the day was busy early on, with dozens of people queueing outside Selfridges on Oxford Street in London before it opened. Fred and Angie Gay, from Essex, have been coming to the West End every 24 December for the past 20 years and were looking for a Christmas present for her. Mrs Gay said: “We’re waiting for Selfridges to open just to have a little look, but my favourite store is Liberty’s. It’s just nice to be up here for Christmas time really, get into the festive spirit.” Hanouf, from Saudi Arabia, said she comes to London every Christmas and appreciates the city’s “vibes” during the festive season. The 28-year-old said she was on the hunt for Apple AirPods and items from upmarket fashion brand Longchamp for herself, but also gift sets for friends because she had not yet started her Christmas shopping. She added that London was her “favourite spot at Christmas”, saying: “I come here yearly, the Christmas lights, the Christmas vibes, the restaurants.” PA Media contributed to this report",
        "pubDate": "2023-12-24 19:55:43",
        "image_url": "https://i.guim.co.uk/img/media/8ef02eefb47520c8999d3555a3551fd85f56c08a/0_63_5568_3341/master/5568.jpg?width=140&quality=85&auto=format&fit=max&s=93940e4bd5e1e8ca9f149da03bed4169",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
            "singapore",
            "united kingdom",
            "india",
            "canada"
        ],
        "category": [
            "business"
        ],
        "language": "english"
    },
    {
        "article_id": "8055a089ad7d38739a6a5942cdb27283",
        "title": "Keep UK trains running at Christmas and save engineering works for January, say campaigners",
        "link": "https://www.theguardian.com/world/2023/dec/23/keep-uk-trains-running-at-christmas-and-save-engineering-works-for-january-say-campaigners",
        "keywords": [
            "Road transport",
            "Transport",
            "Rail transport",
            "Rail travel",
            "Ferry travel",
            "Christmas",
            "UK news"
        ],
        "creator": [
            "James Tapper"
        ],
        "video_url": null,
        "description": "‘It doesn’t have to be this way’: Britain’s transport networks again grind to a halt during festive periodThere was a familiar sense of misery for many travellers in the week before Christmas as hundreds of trains were cancelled, motorways were closed and ferry passengers queued for miles waiting to board their ships.But it doesn’t have to be this way, transport campaigners say, as politicians and transport bosses have the power to ease some of the problems facing travellers. Continue reading...",
        "content": "There was a familiar sense of misery for many travellers in the week before Christmas as hundreds of trains were cancelled, motorways were closed and ferry passengers queued for miles waiting to board their ships. But it doesn’t have to be this way, transport campaigners say, as politicians and transport bosses have the power to ease some of the problems facing travellers. There is more gloom to come in the short term, according to the RAC, with Boxing Day traffic surging, and the prospect of dangerous winds in Scotland and northern England. Around 21 million people drove to visit family or friends before Christmas, and thousands more took flights or trains as what has become known as the great Christmas getaway gained momentum. Storm Pia caused disruption to rail and road in Scotland and northern England on Wednesday. Eurostar workers in France took industrial action the following day, and the knock-on effect was huge demand for ferry services. Motorists queued for 90 minutes during peak times. Saturday was expected to be the busiest day of the year on the roads, according to the RAC and Inrix, with 20% more car journeys than last Christmas weekend. On Boxing Day they expect drivers on the M25 to face 50-minute delays, and on 27 December journeys in busy areas of the UK will be 25% longer. On Saturday Port of Dover Travel reported a 90-minute wait at French border controls as traffic built up after a surge in ferry bookings in the wake of Thursday’s Eurotunnel disruption. And the Met Office is warning of high winds in Scotland, northern England and north Wales today, with possible power cuts and flying debris. Even though the weather may be out of the control of ministers and rail chiefs, they have other ways of easing the burden on travellers, according to the Campaign for Better Transport (CBT) and the Clean Cities Campaign (CCC). National Highways removed 1,000 miles of roadworks on 19 December – “an early Christmas present” for drivers during the festive getaway. They will be back on 2 January. Widespread engineering works are planned for the rail network, although Network Rail said it was carrying out less work than usual, and no trains run on Christmas Day. In London, Paddington station is shut until Wednesday for HS2 works, while King’s Cross is shut today and Victoria station is not running Southeastern services until 2 January. And passengers will be gambling with services by operators such as Avanti West Coast, which cut services in December and has seen 32% of services cancelled or severely delayed. skip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Waiting for a train at Euston station in London on Friday. Photograph: Tolga Akmen/EPA “It doesn’t have to be this way,” said Michael Solomon Williams, CBT campaigns manager. “It’s not rational any more to distinguish between commuter travel and leisure travel.” Since the pandemic, fewer people travel during the week, he said. “People work weekends, go to football matches. There are all sorts of reasons why we need more services at weekends and Christmas, when people travel around the country more than any other time. “Another time makes more sense, like the second week of January, or on a Monday, for example.” He added that another balm for travellers would be the creation of Great British Railways, announced by the government in May 2021 but mothballed in October 2022 . And passengers are being told to pay an extra 4.9% on rail fares in the new year. “They could have frozen fares the way they have with fuel duty for the last 13 years,” Solomon Williams said. “The cost of travelling by train has gone up at twice the rate of driving.” Oliver Lord, head of CCC, said that disrupting services on the busiest travel days of the year meant people were more likely to choose to take the car, adding to congestion. “A third of rail use now is on leisure,” he said. “If the three or four times a year a family wants to use trains to get out of town, and their experience is engineering works, a rail replacement bus service and journeys that take three times as long, what will they think? “It’s a great opportunity for the government to make a strategic decision,” Lord added. “If we said the first week or two of January was a time when businesses and corporations could do things a bit differently, with more working from home, that would be a great new year’s resolution from the government.” Travellers who have faced cancellations or delays should make sure they claim compensation, said Naomi Leach, deputy editor of Which? Travel . “Sadly, it seems as though serious travel disruption over the festive period is becoming increasingly commonplace, with travellers once again facing the misery of cancelled trains as they try to make it home in time for Christmas,” she said. “If your train is cancelled or delayed, make sure you make a note of your ticket number and register a claim via Delay Repay, a nationwide scheme to compensate rail passengers for delays of 15 minutes or more. “The Eurostar operates its own compensation scheme for delays of an hour or more which accepts claims from 24 hours after the disruption took place.”",
        "pubDate": "2023-12-23 19:55:38",
        "image_url": "https://i.guim.co.uk/img/media/ac0290924cd72c7302a9bedb65fdc0affa7b0c54/0_400_6000_3600/master/6000.jpg?width=140&quality=85&auto=format&fit=max&s=82707fc1ac49ff9ce6021c24378b7e6c",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
            "united kingdom",
            "singapore",
            "india",
            "canada"
        ],
        "category": [
            "business"
        ],
        "language": "english"
    },
    {
        "article_id": "dee77ffea64aee0977d123fec0e910d7",
        "title": "James Dyson criticises Tories for not ‘going for growth’ after fall in GDP",
        "link": "https://www.theguardian.com/technology/2023/dec/23/james-dyson-criticises-tories-for-not-going-for-growth-after-fall-in-gdp",
        "keywords": [
            "James Dyson",
            "Economic growth (GDP)",
            "Economics",
            "Business",
            "Kwasi Kwarteng",
            "Rishi Sunak",
            "Conservatives",
            "Jeremy Hunt",
            "Rachel Reeves",
            "Labour",
            "Politics",
            "UK news"
        ],
        "creator": [
            "Geneva Abdul"
        ],
        "video_url": null,
        "description": "Inventor defends economic policies of Kwasi Kwarteng and Liz Truss that sent economy crashingSir James Dyson has criticised the government for not “going for growth” after the latest official figures revealed an increasing likelihood of a recession in the UK.The inventor said wealth generation and growth had become “dirty words” while praising the economic policies of former chancellor Kwasi Kwarteng and former prime minister Liz Truss, whose disastrous mini-budget sent the pound crashing against the dollar and brought the near collapse of pension funds and soaring mortgage costs. Continue reading...",
        "content": "Sir James Dyson has criticised the government for not “going for growth” after the latest official figures revealed an increasing likelihood of a recession in the UK. The inventor said wealth generation and growth had become “dirty words” while praising the economic policies of former chancellor Kwasi Kwarteng and former prime minister Liz Truss , whose disastrous mini-budget sent the pound crashing against the dollar and brought the near collapse of pension funds and soaring mortgage costs. “I was hopeful (with Ms Truss and Mr Kwarteng). I thought they were doing the right thing – I’m the only one who did. Kwarteng wasn’t raising taxes. He was going for growth, which I think is the right thing. It allows us to pay for things and generates wealth,” Dyson, the founder of the eponymous vacuum cleaner firm, told the Daily Telegraph. “I’m disappointed we’re not going for growth”. Downbeat UK growth data adds to picture of an economy going nowhere Read more The remarks come after the latest economic assessment revealed gross domestic product (GDP) fell by 0.1% in the third quarter, rather than the previous estimate of no growth, dealing a blow to the prime minister, Rishi Sunak, who had pledged economic growth by the year’s end and before an expected general election next year. “I’ve always believed that inflation isn’t quite the enemy everyone thinks it is. If you’ve got growth, a bit of inflation doesn’t matter,” said Dyson. Inflation fell to 3.9% in November. “If you get inflation down and kill growth, I think you’re in trouble.” Responding to the GDP data, the chancellor, Jeremy Hunt , said the medium-term outlook for the economy was “far more optimistic” than the recent figures suggest, as the UK comes perilously close to reaching a recession – when the GDP falls for two consecutive quarters – should the economy contract further in the fourth quarter. “We’ve seen inflation fall again this week, and the OBR [Office for Budget Responsibility] expects the measures in the autumn statement, including the largest business tax cut in modern British history and tax cuts for 29 million working people, will deliver the largest boost to potential growth on record,” said Hunt. The Office for National Statistics (ONS) said much of the revision came from a poorer than previously assessed performance by small companies, film production , engineering and design, and the telecommunications and IT sector. Shadow chancellor, Rachel Reeves , said the revised GDP figures show Sunak has failed to meet his promise. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion The Guardian view on economic stagnation: a chronic syndrome causing toxic politics | Editorial Read more She said: “Rishi Sunak is a prime minister whose legacy is one of failure. He failed to beat Liz Truss, he failed to cut waiting lists, he failed to stop the boats and now he has failed to grow the economy. “Thirteen years of economic failure under the Conservatives have left working people worse off, with higher bills, higher mortgages and higher prices in the shops. Darren Morgan, the director of economic statistics at the ONS, said: “The latest data from both our regular monthly business survey and VAT returns show the economy performed slightly less well in the last two quarters than our initial estimates. “The broader picture, though, remains one of an economy that has been little changed over the last year.”",
        "pubDate": "2023-12-23 15:18:17",
        "image_url": "https://i.guim.co.uk/img/media/94eb714c6c090ba590506b92e9f6d5a9effec644/0_280_3600_2160/master/3600.jpg?width=140&quality=85&auto=format&fit=max&s=a11c3772111db26e5d8d7727ee38bb56",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
            "canada",
            "united kingdom",
            "singapore",
            "india"
        ],
        "category": [
            "business"
        ],
        "language": "english"
    }
]